[
    {
      "date": "07-Jul-16",
      "category": "News",
      "lenArticle": "Twenty CBME undergraduates spent two weeks this summer at a coal liquefaction plant in Inner Mongolia, owned by the Hong Kong Towngas group. Through this internship, the students gained an in-depth understanding of the whole production process and all major facilities involved. They visited production units such as air separation, water purification/wastewater treatment, coal gasification, methanol synthesis and hydrocarbon production."
    },

     {
      "date": "20-May-16",
      "category": "News",
      "lenArticle": "Prof. Francesco CIUCCI has been awarded HKD1,384,600 for his ITF project on 'Development of a High-Performance and Safe All-Solid-State Li-ion Battery'."
    },

    {
      "date": "20-May-16",
      "category": "News",
      "lenArticle": "Prof. King Lun YEUNG received the Long Service Award for 20 years services at HKUST."
    },

    {
      "date": "20-May-16",
      "category": "News",
      "lenArticle": "Prof. Henry Lam, Tom Luo and Marshal Liu were named by outstanding students as 'The Teachers I Like (2016)'."
    },

     {
      "date": "20-May-16",
      "category": "News",
      "lenArticle": "Professor Andrew MAK has been promoted to Professor of Engineering Practice."
    },

     {
      "date": "23-Feb-16",
      "category": "News",
      "lenArticle": "HKD1.15 Million Fund Awarded -- Dr. Wei Han, Research Assistant Professor, has received an Innovation & Technology Commission & Industries fund of HKD 1.15 million for his work on 'Ionic Liquid Filtration System for Air Purification and Disinfection'. His co-Investigators are Professor King Lun YEUNG and Professor Joseph KC Kwan."
    },

     {
      "date": "23-Feb-16",
      "category": "News",
      "lenArticle": "Professor Elected to AIChE -- Dr. Guohua CHEN, Professor and Head of CBME, has been elected as Fellow of the American Institute of Chemical Engineers, the highest grade of membership of AIChE. This honor recognizes distinctive professional achievements and accomplishments."
    },

 	{
      "date": "23-Nov-15",
      "category": "News",
      "lenArticle": "CBME team representing HKUST won the Outstanding Award at the 14th National Challenge Cup competition"
    },


    {
      "date": "20-Oct-15",
      "category": "News",
      "lenArticle": "Miss Pui Yan LAU, our Chemical & Biomolecular Engineering student, has been selected to be a recipient of the HKUST Academic Achievement Medal this year. This is the highest academic honor that this University bestows upon undergraduate students at graduation. Only graduates with an average of grade A in all courses taken throughout their program of study, with no record of a failed course, are qualified for the Medal. Only the top 1% of graduates are awarded the Medal each year. The Academic Achievement Medal will be presented to her at the University Congregation on 20 November 2015."
    },

    {
      "date": "13-Oct-15",
      "category": "News",
      "lenArticle": "Prof. Marshal YS LIU has received the School of Engineering Distinguished Teaching Excellence Appreciation Award 2014-15."
    },

	{
      "date": "13-Oct-15",
      "category": "News",
      "lenArticle": "Prof. Francesco CIUCCI has received the School of Engineering Teaching Excellence Appreciation Award 2014-15. Professor Ciucci receives the award because of his excellent teaching of U-Core course, and also his successful recruitment and supervision of postgraduate students."
    },

	{
      "date": "05-Oct-15",
      "category": "News",
      "lenArticle": "Carolina Garcia, an UG student, joined FEALAC Youth Conference 2015."
    },

    {
      "date": "11-Jul-15",
      "category": "News",
      "lenArticle": "Our Alumnus, Miss Samantha Kong, just published a book title 'Who Said Engineering Is a Bad Choice in Hong Kong?'"
    },

    {
      "date": "02-Jul-15",
      "category": "News",
      "lenArticle": "10 faculty members received HK RGC GRF/ECS funding awards for cutting edge research"
    },

    {
      "date": "10-Jun-15",
      "category": "News",
      "lenArticle": "Two teams won prizes at the Fifth Annual HKUST One Million Dollar Entrepreneurship Competition"
    },

	{
      "date": "13-May-15",
      "category": "News",
      "lenArticle": "Ping GENG, PhD candidate of Prof. Guohua CHEN, has been selected as the Winner of the Chan-Tak-Kei&Wong-Kwai-Ying Best PG Award 2015"
    },

    {
      "date": "21-Apr-15",
      "category": "News",
      "lenArticle": "Ms. Ping GENG of CBME won the 2015 SENG Three Minute Thesis Competition"
    },

    {
      "date": "20-Apr-15",
      "category": "News",
      "lenArticle": "Professor Terrence Yee has been promoted to Professor of Engineering Practice"
    },

    {
      "date": "20-Apr-15",
      "category": "News",
      "lenArticle": "Professor Shiping ZHU has been bestowed the title of Distinguished University Professor by McMaster University"
    },

    {
      "date": "15-Apr-15",
      "category": "News",
      "lenArticle": "Tsz Wing FAN, a PhD student of Prof. I-Ming Hsing, has won the Best Poster Prize at Symposium JJ at The MRS Spring Meeting 2015 in San Francisco"
    },

    {
      "date": "13-Mar-15",
      "category": "News",
      "lenArticle": "The department presents long serve awards to six faculty and staff."
    },

    {
      "date": "13-Mar-15",
      "category": "News",
      "lenArticle": "The department welcomes Professor Shiping Zhu joined the department as a Visiting Professor."
    },

    {
      "date": "06-Feb-15",
      "category": "News",
      "lenArticle": "Our PhD graduate from Professor I-Ming HSING’s group, Dr. Feng XUAN, has been successfully selected as the winner of the School of Engineering PhD Research Excellence Award 2014-15.."
    },


    {
      "date": "04-Feb-15",
      "category": "News",
      "lenArticle": "Our graduate, Miss Samantha KONG, was selected as one of the four youth to conduct dialogue with Mr. Jack Ma, Founder of Alibaba."
    },

    {
      "date": "27-Jan-15",
      "category": "News",
      "lenArticle": "Prof. Xijun HU has been awarded HKD1,334,360 for his ECF project on "Development of SBA15-based Bimetallic Ni-Zr Catalysts for NOx Abatement"."
    },

    {
      "date": "27-Jan-15",
      "category": "News",
      "lenArticle": "In Memory of Pat McDonald"
    },

    {
      "date": "03-Dec-14",
      "category": "News",
      "lenArticle": "Professors met our alumni at the 2014 AIChE meeting in Atlanta"
    },

    {
      "date": "03-Dec-14",
      "category": "News",
      "lenArticle": "Professor Ying CHAU's work is highlighted by C&EN. The work on self-assembly from Professor Ying CHAU's lab has been accepted by JACS and is featured in the Chemical and Engineering News."
    },

    {
      "date": "19-Nov-14",
      "category": "News",
      "lenArticle": "Dr. Renu Tyagi on her receiving the Certificate of Appreciation in 2014 President's Outstanding Service Award"
    },

    {
      "date": "27-Oct-14",
      "category": "News",
      "lenArticle": "Professor Chi Wai HUI won the School of Engineering Teaching Excellence Appreciation Award for 2013-14"
    },

    {
      "date": "14-Oct-14",
      "category": "News",
      "lenArticle": "Professor Zhengtang LUO Was Awarded Hong Kong: Scotland Collaborative Research Partnership Fund"
    },

    {
      "date": "30-Sep-14",
      "category": "News",
      "lenArticle": "Professor Richard LAKERVELD joined the department today"
    },


    {
      "date": "17-Sep-14",
      "category": "News",
      "lenArticle": "Ms Ping GENG, PhD candidate, won the Best Poster Award at the 65th Annual Meeting of the International Society of Electrochemistry"
    }, 


    {
      "date": "08-Sep-14",
      "category": "News",
      "lenArticle": "Miss Samantha Kong, the past President of HKUST AIChE Student Chapter, visited AIChE HQ in June when she was taking her intern at the UN. She met the President of AIChE there. She also met the community manager of ChEnected, which is the AIChE's blog. She wrote a small article introducing HKUST student chapter and the activities held in HK. The article can be viewed at <a href="http://chenected.aiche.org/students/news-from-kong-kong-aiche-student-chapter/" target="_blank">here</a> <br><br>Samantha just started working as a Graduate Environmental Engineer and promised to continue supporting and engaging in the student chapter. An AGM will be held in late September."
    },

	{
      "date": "08-Aug-14",
      "category": "News",
      "lenArticle": "The Chemical and Biomolecular Engineering Department welcomes Dr. Fei SUN join the department as an Assistant Professor"
    }, 


    {
      "date": "26-Jul-14",
      "category": "News",
      "lenArticle": "Feng XUAN, a PhD student, and his supervisor, Prof. I-Ming HSING, have recently published a paper in JACS, Journal of the American Chemical Society. This paper is also highlighted in the latest issue of JACS Spotlights."
    }, 

	{
      "date": "25-Jul-14",
      "category": "News",
      "lenArticle": "Professor Furong GAO has won a National Science Foundation of China key project award entitled "High Performance Control of Batch Process". He was awarded a grant which he will be able to use at the Nansha campus to conduct research and support PG students."
    }, 

    {
      "date": "08-Aug-14",
      "category": "News",
      "lenArticle": "The Chemical and Biomolecular Engineering Department welcomes Dr. Fei SUN join the department as an Assistant Professor"
    },
    
     {
      "date": "09-Jul-14",
      "category": "News",
      "lenArticle": "Congratulations to our students, Carolina Lissette GARCIA HENRIQUEZ, Sunyoung HWANG and Jin LIU, who have successfully obtained Reaching Out Award (ROA) this year. All our students are strongly encouraged to participate in symposium and conference, and subsidy may be granted by the department or Hong Kong government."
    },

    {
      "date": "10-Jun-14",
      "category": "News",
      "lenArticle": "A team led by our CBME student won the 2nd Prize at the 4th Annual HKUST One Million Dollar Enterpreneurship Competition"
    },
    
    {
      "date": "05-Jun-14",
      "category": "News",
      "lenArticle": "Professor Henry H N LAM is promoted to Associate Professor with Substantiation!"
    },
    
    {
      "date": "29-May-14",
      "category": "News",
      "lenArticle": "Success of AIChE student chapter at HKUST"
    },

     {
      "date": "22-May-14",
      "category": "News",
      "lenArticle": "Professor Minhua SHAO received the Supramaniam Srinivasan Young Investigator Award from the Electrochemical Society (ECS)"
    },
 
  	{
      "date": "07-May-14",
      "category": "News",
      "lenArticle": "Professor Jean-Marie TARASCON, CBME Adjunct/Visiting Professor, has been elected as a Fellow of Royal Society of UK."
    },

	{
      "date": "29-Apr-14",
      "category": "News",
      "lenArticle": "Professor Yuan Shuai LIU has been awarded the title of "Assistant Professor of Engineering Education" by the HKUST Provost and Executive Vice President Office. This title is awarded only to faculty who have demonstrated excellency in their own teaching and courses, and who have also taken on a broader role, working with colleagues to promote quality teaching, address major teaching and learning needs and develop new ideas and initiatives to support quality teaching and learning in association with School's unit for education development."
    },
 
 	{
      "date": "08-Apr-14",
      "category": "News",
      "lenArticle": "Miss Samantha Wing-man KONG, CBME UG student, received the Top 10 Outstanding Youth Award from the Hong Kong Government. <a href="http://www.cbme.ust.hk/cgi-bin/deptvideo_view.php?video_id=1"><img src="http://www.cbme.ust.hk/images/icon_download.gif" border="0" /></a>"
    },

    {
      "date": "26-Feb-14",
      "category": "News",
      "lenArticle": "2013 QS University Subject Ranking, Chemical Engineering was ranked #2 in greater China, #8 in Asia and #26 in World."
    },

    {
      "date": "14-Jan-14",
      "category": "News",
      "lenArticle": "Mr. Adetoyese Olajire OYEDUN has been awarded the SENG PhD Research Excellence Award 2013."
    },

    {
      "date": "27-Dec-13",
      "category": "News",
      "lenArticle": "Professor Arun S. MUJUMDAR received National Award of International Collaboration"
    },

    {
      "date": "09-Dec-13",
      "category": "News",
      "lenArticle": "First workshop towards strategic partnership building"
    },

    {
      "date": "12-Nov-13",
      "category": "News",
      "lenArticle": "Prof. King Lun YEUNG has been awarded the highly competitive NSFC/RGC Joint Research Scheme (2013/2014) and a substantial grant to work on "Investigation of new multi-functional materials based on hierarchical porous mixed oxides and carbon aerogels for air purification and disinfection". His mainland partner is Prof. Jieshan Qiu of Dalian University of Technology"
    },
 

 	{
      "date": "01-Nov-13",
      "category": "News",
      "lenArticle": "Samantha Wing Man Kong, CBME 3rd Year Undergraduate Student, has been awarded the Sai Kung Outstanding Youth Award (Open Group) under the Outstanding Youth Commission Scheme 2013-2014. This annual program is jointly organized by the Home Affairs Bureau and the Commission on Youth."
    },

    {
      "date": "27-Sep-13",
      "category": "News",
      "lenArticle": "Tsz Nok NG, a PhD student of Professor King Lun YEUNG, won the Best Poster Award at the APCBM 2013 Conference, held in the Korea August 2013."
    },

    {
      "date": "20-Aug-13",
      "category": "News",
      "lenArticle": "The Air Products Award for the Best Chemical and Biomolecular Engineering Postgraduate Student 2013 - Adetoyese Olajire OYEDUN."
    },

    {
      "date": "205-Jul-13",
      "category": "News",
      "lenArticle": "VISITING PROFESSOR IS ENVIRONMENT, SUSTAINABILITY AND ENERGY DIVISION AWARD 2013 WINNER Dr Rafael Luque, Visiting Professor and Distinguished Engineering Fellow of CBME, was recognized with this award for his outstanding work in the multidisciplinary areas of nanomaterials, green chemistry and energy. Dr Luque (University of Cordoba, Spain) has significant experience on biomass and waste valorisation practises to materials, fuels and chemicals over the past 10 years. He has also published more than 160 research articles, filed 3 patent applications and edited 7 books, is a member of the Editorial Advisory Board of several reputed journals, and has been awarded numerous awards and recognition to his scientific career."
    },

    {
      "date": "08-May-13",
      "category": "News",
      "lenArticle": "Professor Chi Ming CHAN was elected as a Fellow of IUPAC (the International Union of Pure and Applied Chemistry) in Jan 2012. Professor Chan's elevation to Fellow is in recognition of his contributions to IUPAC and research achievements in polymer science and academic achievements."
    },

    {
      "date": "06-May-13",
      "category": "News",
      "lenArticle": "A team from CBME won the Silver Award 2013 President's Cup for its Final Year Project entitled, Endothelial Cell-Adhesive Injectable Hydrogel as Endovascular Embolizing Agent. The team consisted of Ka Hei HO, Yuen Man IP, Siu Man NG, Ping Hei SHING and Andrea VILLAROMAN, and was supervised by Professor Ying CHAU. The President's Cup is an annual event at HKUST for undergraduate graduates to compete based on outstanding achievements in research and innovation."
    },

    {
      "date": "03-May-13",
      "category": "News",
      "lenArticle": "A team from CBME won the 2013 President's Cup for its Final Year Project entitled, Micro-Mini Pulsed Electric Field Technology for Point-of-use Disinfection of Tap Water. The team consisted of San Hung CHOI, Yee Man CHOI, Kwong Mun KWOK and Chui Hung YAU, and was supervised by Professor King Lun YEUNG. The President's Cup is an annual event at HKUST for undergraduate graduates to compete based on outstanding achievements in research and innovation."
    },

    {
      "date": "02-May-13",
      "category": "News",
      "lenArticle": "CBME Student Receives Sponsorship to Attend Worldwide Forum CBME student Wing Man KONG (Samantha) recently attended the 3-day G20 Youth Forum in Petersborough as a HKUST representative. Samantha was sponsored by both the GCE Committee and CBME department. Samantha said sharing and exchanging thoughts and opinions with people from all over the world, and learning about initiatives taken in other countries, was one of her most unforgettable experiences of the forum. "The conversations I had with these future leaders gave me new insights about my current research on air pollution problem in Hong Kong," she said. "I learnt more about how other countries are dealing with this problem. I will discuss and work with my friends to see how to better address the pollution problem in Hong Kong.""
    },

    {
      "date": "02-Mar-13",
      "category": "News",
      "lenArticle": "A team of HKUST with one of our UG student, Samantha Wing Man KONG , as a core member, won the Champion and Best Presentation Award at the Hong Kong Social Enterprise Challenge"
    },

    {
      "date": "03-Jan-13",
      "category": "News",
      "lenArticle": "PROFESSOR Furong GAO REAPS AWARD FOR RESEARCH EXCELLENCE IN NATURAL SCIENCE 2012 Professor Gao and his team were honored by the Ministry of Education with this prestigious award which recognizes outstanding research projects at all tertiary institutions in China. The project, on the Theory of High-performance Batch Process Control Systems, achieved major breakthroughs in process modeling; process control; process monitoring and quality prediction; process optimization; and new quality measurement technology. More...."
    },

    {
      "date": "05-Dec-12",
      "category": "News",
      "lenArticle": "Professor Furong GAO received the FIRST CLASS Award from Ministry of Education on his outstanding research accomplishment for process control."
    },

    {
      "date": "08-Oct-12",
      "category": "News",
      "lenArticle": "The Air Products Award for the Best Chemical and Biomolecular Engineering Postgraduate Student 2012 - Ka Leung LAM."
    },

    {
      "date": "21-Sep-12",
      "category": "News",
      "lenArticle": "A Team composed of UG students (Fung Chu LI, Bowen SUN, Hon Ting WONG, Lang XU) won First Class Prize in China design Competition on Energy Saving and Emission Reduction held this summer at XJTU."
    },

    {
      "date": "21-Sep-12",
      "category": "News",
      "lenArticle": "2012 QS University Subject Ranking, Chemical Engineering was ranked #1 in greater China, #4 in Asia and #20 in World."
    },

    {
      "date": "28-Aug-12",
      "category": "News",
      "lenArticle": "Lang XU and Kai Qi YAN, CBME 2012 UG graduates, each received the 2012 Academic Achievement Medal - the highest academic honor bestowed by HKUST on outstanding undergraduate students. The Academic Achievement Medal was established in 1994 to recognize graduates whose outstanding academic achievements bring honor and distinction both to themselves and to the University."
    },

    {
      "date": "08-May-12",
      "category": "News",
      "lenArticle": "A team from CBME won the 2012 President's Cup for its Final Year Project entitled, "Processing of high-performance porous membranes for fuel cell applications". The team consisted of Fung Chu LI, Bowen SUN, Hon Ting WONG, Lang XU, and was supervised by Professor Ping GAO. The President's Cup is an annual event at HKUST for undergraduate graduates to compete based on outstanding achievements in research and innovation."
    }, 


    {
      "date": "04-May-12",
      "category": "News",
      "lenArticle": "A team from CBME won the Silver Award in the 2012 President's Cup for its Final Year Project entitled, "In Situ Hydrogel for Cosmetic Injection". The team consisted of LAM, Pik Kei, YAN, Kai Qi, YI, Fei Ran, YIP, Siu Man, and was supervised by Professor Ying CHAU."
    },

    {
      "date": "04-May-12",
      "category": "News",
      "lenArticle": "Professor Gordon MCKAY was awarded the Honorable Mention for the Distinguished Research Award from School of Engineering, HKUST. The award is only given to only one faculty member for the whole school each year, and reflects Professor McKay's excellent academic and industrial contributions."
    },

    {
      "date": "11-Apr-12",
      "category": "News",
      "lenArticle": "CBME third-year students Jeromy Chun Yuen CHAN, Ho San MAK, Lawrence Kai Qi YAN and Karen Pik Shuen HUNG won the Gold Award of the "Shape our Sustainable Campus" organized by the Hong Kong Institution of Engineers. The team beat out 13 teams and 40 participants to win this prestigious award with an innovative system to recycle food. The system, based on a patent from Productivity Council, converts food waste into fertilizer, which is used for roof-top farming and organic gardens. Food grown will then be sold to students and funds raised will maintain the sustainability of the project. As food waste accounts for 40% of municipal waste and treatment of food waste can be difficult, the team took this opportunity to make a positive difference to HKUST's sustainability initiatives."
    },

    {
      "date": "03-Apr-12",
      "category": "News",
      "lenArticle": "Shammi Akter FERDOUSI, a PhD student of Professor King Lun YEUNG, won the Best Poster Award at the 243rd ACS National Meeting & Exposition held in the U.S., in March 2012."
    },

    {
      "date": "26-Mar-12",
      "category": "News",
      "lenArticle": "Leiting ZHANG, an MPhil student supervised by Prof. Guohua CHEN, was awarded "SinoPoly Battery Scholarship" by Sinopoly Battery Ltd during 2011 academic year."
    },

    {
      "date": "08-Feb-12",
      "category": "News",
      "lenArticle": "Leiting ZHANG, a CENG student supervised by Prof. Guohua CHEN, was the First Runner-Up in the 2011 UROP. The title of his project was: Making of the Lithium Ion Battery and the Testing of Its Performance."
    },

    {
      "date": "08-Feb-12",
      "category": "News",
      "lenArticle": "Siu Yeung CHEUNG, a CEEV student supervised by Prof. King Lun YEUNG, was the Second Runner-Up in the 2011 UROP. The title of his project was: Field Study of a Smart Antimicrobial Coating."
    },

    {
      "date": "22-Nov-11",
      "category": "News",
      "lenArticle" : "Dr Weiping WANG, a recent PhD graduate who studied under Professor Ying CHAU, received the PhD Research Excellence Award 2011 from UST's School of Engineering."
    },

    {
     "date": "03-Nov-11",
     "category": "News",
     "lenArticle": "Prof. Henry H N LAM has received the School of Engineering Teaching Excellence Appreciation Award 2010-2011"
    },

    {
     "date": "01-Nov-11",
     "category": "News",
     "lenArticle": "Prof. Yuan Shuai LIU was awarded <strong>The Faculty Awards for Outstanding Performance and Achievements in Teaching</strong> at PolyU, 2010-2011. He is also the recipient of Good Teacher Award in the Department of Applied Biology & Chemical Technology in 2011."
    },

    {
     "date": "14-Sep-11",
     "category": "News",
     "lenArticle": "Shammi Akter Ferdousi, a PhD student of Prof King Lun YEUNG, won the Gold Award for the Best Poster Presentation at the Asia Nanotech Camp 2011"
    },

    {
     "date": "01-Sep-11",
     "category": "News",
     "lenArticle": "One of Prof. Gordon MCKAY's papers published while at HKUST in Process Biochemistry in 1998 entitled <strong>Pseudo-second order model of sorption process</strong> by Ho YS; McKay G., has been the number 1 most cited paper in the Chemical Engineering category of Science Citation Index for four consecutive years; 2008, 2009, 2010 and 2011."
    },

    {
     "date": "01-Sep-11",
     "category": "News",
     "lenArticle": "Prof. Furong GAO was awarded <strong>The Journal of Process Control Survey Paper Prize</strong>. Awarded jointly by Elsevier Ltd and the International Federation of Automatic Control (IFAC) for the best paper published in the period 2008-2011."
    },

    {
     "date": "25-Aug-11",
     "category": "News",
     "lenArticle": "The Air Products Award for the Best Chemical and Biomolecular Engineering Postgraduate Student 2011 - Weiping WANG."
    },

    {
     "date": "22-Aug-11",
     "category": "News",
     "lenArticle": "Weiping WANG, a Ph.D. student supervised by Prof. Ying CHAU, has been awarded the Young Investigator Award at the 5th WACBE World Congress on Bioengineering in Taiwan for his work on "Construction of two-component nanoparticles for targeting of cancer cells". The prize was sponsored by the IEEE Engineering in Medicine and Biology Society and Taiwanese Society of Biomedical Engineering."
    },


    {
     "date": "25-Jul-11",
     "category": "News",
     "lenArticle": "Prof. King Lun YEUNG, Dr. Wei HAN and Mr. Wai Kit CHAN won the Best Poster Award at the International Conference on Materials for Advanced Technologies 2011. The winning poster title was: Advanced Ozone-membrane Reactor for Treatment of Endocrine Disrupting Compounds in Water."
    },

    {
     "date": "19-May-11",
     "category": "News",
     "lenArticle": "A team from CBME won the Gold Award in 2011 President's Cup for its Final Year Project entitled "Design of Lithium-ion Batteries for Electric Vehicles". The team consisted of Weicheng LUO, Leiting ZHANG, Yuan ZHONG and Siwan LU, and was supervised by Professor Guohua CHEN."
    },

    {
     "date": "19-Apr-11",
     "category": "News",
     "lenArticle": "Prof Ying CHAU was awarded the Distinguished Teaching Award 2010 from the School of Engineering."
    },

    {
     "date": "19-Apr-11",
     "category": "News",
     "lenArticle": "A team from CBME was the Winner of the 2010 President's Cup for its FYP project, Ultrasound-mediated Delivery of Macromolecules to the Eye. The winning members are Kit Yi LEUNG, Ho Yan TSE, Nok Kwan WONG and Hok Ting YAU."
    }, 
    
    {
     "date": "11-Mar-11",
     "category": "News",
     "lenArticle": "Prof. Guohua CHEN got the Research Excellence Award. The Research Excellence Award recognizes the efforts of an outstanding faculty member with a proven record of research excellence."
    },
    
    {
     "date": "01-Dec-10",
     "category": "News",
     "lenArticle": "Article on "Teaching Excel VBA as a problem solving tool for chemical engineering core courses" by Wong, K.W.W. & John BARFORD, J.P. is one of the most cited."
    },
    
    {
     "date": "23-Nov-10",
     "category": "News",
     "lenArticle": "Xinqing CHEN, PG student for Prof. King Lun YEUNG, received the "Achived Excellence in 2010 Science Young Scientist Award in Engineering Science""
    }, 
    
    {
     "date": "04-Nov-10",
     "category": "News",
     "lenArticle": "HKUST was ranked 29th globally in Chemical Engineering in 2010 in terms of the quantity and quality of research papers. The ranking was according to Higher Education Evaluation & Accreditation Council of Taiwan"
    }, 
    
    {
     "date": "23-Nov-10",
     "category": "News",
     "lenArticle": "Xinqing CHEN, PG student for Prof. King Lun YEUNG, received the "Achived Excellence in 2010 Science Young Scientist Award in Engineering Science""
    },
    
    {
     "date": "04-Nov-10",
     "category": "News",
     "lenArticle": "Professor Xijun HU was elected to the Board of Directors of International Adsorption Society in May 2010"
    }, 
    
    {
     "date": "25-Oct-10",
     "category": "News",
     "lenArticle": "Brian Xinqing CHEN has been shortlisted as one of the four finalists for the Hong Kong Institution of Science Young Scientist Award in Engineering Science. Each of the finalists will give a presentation to a judging panel, after which the winner will be selected. Brian is a student of Professor King Lun YEUNG"
    }, 
    
    {
     "date": "14-Sep-10",
     "category": "News",
     "lenArticle": "Owen Ka Fai Luk, a CBME alumni, has won the Trainee of the Year Award by the Hong Kong Institute of Engineers."
    },
    
    {
     "date": "13-Sep-10",
     "category": "News",
     "lenArticle": "The Air Products Award for the Best Chemical and Biomolecular Engineering Postgraduate Student 2010 - Richard Yiu Ting LAU"
    },
    
    {
     "date": "09-Sep-10",
     "category": "News",
     "lenArticle": "HKUST Develops World's First Smart Anti-microbial Coating to Control Infectious Diseases"
    },
    
    {
     "date": "26-Aug-10",
     "category": "News",
     "lenArticle": "Ms. Yange SUO, a CBME Ph.D. student, has been awarded a poster award in the "1st International Fuel Cell Summer Seminar for Young Scientists 2010" held in Aug 2010 in Yamanashi Japan. Ms. Suo is a student of Professor I-Ming Hsing. She won her award for her paper entitled: Impedance based mechanistic understanding of formic acid oxidation on Pd/C and synthesis of bimetallic Pd-Au nanoparticles for direct formic acid fuel cell application."
    },
    
    {
     "date": "25-Jan-10",
     "category": "News",
     "lenArticle": "Dr. King Lun YEUNG is appointed as Co-Editors for the Chemical Engineering Journal, Elsevier"
    }, 
    
    {
     "date": "24-Jan-10",
     "category": "News",
     "lenArticle": "The Best Chemical & Biomolecular Engineering Postgraduate Student Award 2009 - Zhang Huanjun"
    },  
    
    {
     "date": "23-Jan-10",
     "category": "News",
     "lenArticle": "An article by Professor I-Ming Hsing and his group has been selected as a "Hot Article" in the Analyst, an RSC journal."
    },
    
    {
     "date": "21-Jan-10",
     "category": "News",
     "lenArticle": "Professor I-Ming Hsing invited to become the first ever Chinese Regional Editor of the journal Electroanalysis, starting 2010"
    },
    
    {
     "date": "20-Jan-10",
     "category": "News",
     "lenArticle": "Professor Chi Ming CHAN has been named one of Top 50 Authors (Most Cited, 2002-2008) in Polymer. A paper by Professor Chi Ming CHAN and his research team is also on the Top 20 Cited Articles list (2000-2002)"
    },
    
    {
     "date": "19-Jan-10",
     "category": "News",
     "lenArticle": "Professor Yongli MI and researchers from Arizona State University have, for the first time, constructed a DNA 3D object by a single strand DNA and successfully cloned the DNA 3d in vivo. Results have been published in the Journal of the American Chemical"
    }, 
    
    {
     "date": "18-Jan-10",
     "category": "News",
     "lenArticle": "15 th Anniversary Celebrations"
    },
    
    {
     "date": "17-Jan-10",
     "category": "News",
     "lenArticle": "Industry Day 2009"
    },
    
    {
     "date": "15-Jan-10",
     "category": "News",
     "lenArticle": "Mphil graduate, Ling Tsz Yan, has been awarded a fellowship by the Abplanalp Sanders Memorial Fellowship Fund in the U.S. The Fund supports students involved in research related to the use of aerosols in consumer products or for harmaceutical applications."
    }, 
    
    {
     "date": "14-Jan-10",
     "category": "News",
     "lenArticle": "PhD Student Wins "SIMS SVII Student Awards" Competition"
    },
    
    {
     "date": "13-Jan-10",
     "category": "News",
     "lenArticle": "The Air Products Award for the Best Chemical & Biomoleuclar Enginering Postgraduate Student 2008 - Diming WEI"
    },
    
    {
     "date": "12-Jan-10",
     "category": "News",
     "lenArticle": "Scholarship Awarded"
    }, 
    
    {
     "date": "11-Jan-10",
     "category": "News",
     "lenArticle": "MPhil Graduate Awarded Special fellowship and Features in the National Aerosol Soociation Newsletter"
    }, 
    
    {
     "date": "10-Jan-10",
     "category": "News",
     "lenArticle": "Students' Pollution Study Published in Local Newspaper"
    },
    
    {
     "date": "09-Jan-10",
     "category": "News",
     "lenArticle": "Alumni Awarded Newton International Fellowship"
    },
    
    {
     "date": "08-Jan-10",
     "category": "News",
     "lenArticle": "Students Complete Oxfam Trailwalker"
    },
    
    {
     "date": "07-Jan-10",
     "category": "News",
     "lenArticle": "PhD Student's Paper Nominated to Excellence in Graduate Polymer Research Symposium"
    },
    
    {
     "date": "06-Jan-10",
     "category": "News",
     "lenArticle": "Professor Chak Keung CHAN appointed Atmospheric Environmental Editor-in-Chief"
    },
    
    {
     "date": "05-Jan-10",
     "category": "News",
     "lenArticle": "Professor Ka Ming NG has been invited as a Guest Professor for a Summer School in the South China University of Technology."
    },
    
    {
     "date": "04-Jan-10",
     "category": "News",
     "lenArticle": "Professor Ping GAO received the School of Engineering Teaching Award 2007-2008"
    },
    
    {
     "date": "03-Jan-10",
     "category": "News",
     "lenArticle": "Professor Edmond Ko was voted "Ten Best Lecturers" at HKUST"
    },
    
    {
     "date": "02-Jan-10",
     "category": "News",
     "lenArticle": "Prof Furong GAO got the best paper award in Annual Technical Conference 2005 (ANTEC 2005), Boston, USA"
    },
    
    {
     "date": "01-Jan-10",
     "category": "News",
     "lenArticle": "Professor Guohua CHEN is appointed as an Editor of Separation and Purification Technology, a journal published by Elsevier with an impact factor of 1.23"
    },
    
    {
     "date": "26-Jan-09",
     "category": "News",
     "lenArticle": "Prof Chak Keung CHAN was conferred the 2009 State Natural Science Award (SNSA), second class."
    },
    
    {
     "date": "01-Sep-08",
     "category": "News",
     "lenArticle": "Prof. Gordon MCKAY led the major pilot plant research and development project to combust Hong Kong municipal solid waste in an integrated cement manufacturing process from 2003 to 2008."
    },
    
    {
     "date": "01-May-07",
     "category": "News",
     "lenArticle": "A team from CBME won the 2007 President's Cup for its Final Year Project entitled, " Production of particles for pulmonary drug delivery via aerosol technology ". The team consisted of CHEUNG Chi Yeung, CHEUNG Tsz Wing, CHUNG Yiu Lun and HAU Yu K, and was supervised by Professor CK CHAN. The President's Cup is an annual event at HKUST for undergraduate graduates to compete based on outstanding achievements in research and innovation."
    },
    
    {
     "date": "21-Jun-06",
     "category": "News",
     "lenArticle": "Nanotechnology Creates Super-Strong Fibers for Bullet-Proof Vests"
    },
    
    {
     "date": "01-Jul-03",
     "category": "News",
     "lenArticle": "New institute to propel Hong Kong nano leap."
    },
    
    
    {
	 "date": "19-Aug-16",
	 "category": "Spotlights",
	 "name": "High Capacity LiMO2 for High Energy Batteries",
	 "lenArticle": "Seminar by Prof. Lu LI on 19 August 2016 in Rm 4589 at 10:30. Title: High Capacity LiMO2 for High Energy Batteries"
	},
    
    {
	 "date": "17-Aug-16",
	 "category": "Spotlights",
	 "name": "Label-free SPR and SPR imaging analysis with plasmonic microarrays and calcinated nanofilms",
	 "lenArticle": "Seminar by Dr. Quan Jason Cheng on 17 August 2016 in Rm 4589 at 10:30. Title: Label-free SPR and SPR imaging analysis with plasmonic microarrays and calcinated nanofilms"
	},
    
    {
	 "date": "04-Jul-16",
	 "category": "Spotlights",
	 "name": "A vapor-phase deposition method for functional polymer thin films and their device applications",
	 "lenArticle": "Seminar by Prof. Gap Im SUNG on 4 July 2016 in Rm 4589 at 14:30. Title: A vapor-phase deposition method for functional polymer thin films and their device applications"
	},
    
    {
	 "date": "30-Jun-16",
	 "category": "Spotlights",
	 "name": "Dynamics of Oxidation of well-defined adsorbed co phases on Pt(111) in aqueous acidic electrolytes: Simultaneous in situ second harmonic generation and differential reflectance spectroscopy",
	 "lenArticle": "Joint Seminar of Department of Chemical and Biomolecular Engineering and HKUST Energy Institute by Prof. Daniel A. Scherson on 30 June 2016 in Chen Kuan Cheng Forum (LTH) at 11:00. Title: Dynamics of Oxidation of well-defined adsorbed co phases on Pt(111) in aqueous acidic electrolytes: Simultaneous in situ second harmonic generation and differential reflectance spectroscopy"
	},
    
    {
	 "date": "23-Jun-16",
	 "category": "Spotlights",
	 "name": "Development of biomimetic scaffolds for bone regeneration",
	 "lenArticle": "Seminar by Prof. Mei WEI on 23/6/2016, 14:00 at Rm4589 (Lift29-30). Title:Development of biomimetic scaffolds for bone regeneration"
	},
    
    {
	 "date": "20-Jun-16",
	 "category": "Spotlights",
	 "name": "Total Synthesis of Nanocomposites",
	 "lenArticle": "SSeminar by Prof. Thomas SEERY on 20/6/2016, 14:00 at Rm4589 (Lift29-30). Title:Total Synthesis of Nanocomposites"
	},
    
    {
	 "date": "15-Jun-16",
	 "category": "Spotlights",
	 "name": "Understanding fuel chemistry for a CO2-worried world",
	 "lenArticle": "Seminar by Prof. Philip R. Westmoreland on 15 June 2016 in Chen Kuan Cheng Forum (LTH) at 11:00. Title: Understanding fuel chemistry for a CO2-worried world"
	},
    
    {
	 "date": "16-Jun-16",
	 "category": "Spotlights",
	 "name": "Formation Of polymeric nanoparticles encapsulating hydrophobic compounds",
	 "lenArticle": "Seminar by Prof. Ying Liu on 16/5/2016, 10:30 at Rm4589 (Lift29-30). Title:Formation Of polymeric nanoparticles encapsulating hydrophobic compounds"
	},
    
    {
	 "date": "06-May-16",
	 "category": "Spotlights",
	 "name": "The Importance of Catalysis in the Electrochemical Oxygen Transfer Reactions (EOTR)",
	 "lenArticle": "Seminar by Prof. Christos Comninellis on 6/5/2016, 16:00 at Rm4620. Title: The Importance of Catalysis in the Electrochemical Oxygen Transfer Reactions (EOTR)"
	},
    
    {
	 "date": "29-Apr-16",
	 "category": "Spotlights",
	 "name": "Research Technology Development: from laboratory to industry",
	 "lenArticle": "Joint Seminar: CBME and MAE by Mr. Bill B C Zhao on 29/4/2016, 16:00 at Rm4620. Title: Research Technology Development: from laboratory to industry"
	},
    
    {
	 "date": "28-Apr-16",
	 "category": "Spotlights",
	 "name": "Synthesis and Recycle of NMC Cathode Materials",
	 "lenArticle": "PhD Qualifying Examination by Quan LI on 28 April 2016 in Rm 3598 (lifts 25-26) at 14:00. Title: Synthesis and Recycle of NMC Cathode Materials"
	},
    
    {
	 "date": "28-Apr-16",
	 "category": "Spotlights",
	 "name": "Synthesis and Characterization of Novel Thermoelectric Materials",
	 "lenArticle": "PhD Qualifying Examination by Khak Ho LIM on 28 April 2016 in Rm 3598 (lifts 25-26) at 09:30. Title: Synthesis and Characterization of Novel Thermoelectric Materials"
	},
    
    {
	 "date": "21-Apr-16",
	 "category": "Spotlights",
	 "name": "Ionic Liquid-Nanoparticle Hybrid Electrolytes for Lithium Batteries",
	 "lenArticle": "PhD Qualifying Examination by Yang LI on 21 April 2016 in Rm 1504 (lifts 25-26) at 10:00. Title: Ionic Liquid-Nanoparticle Hybrid Electrolytes for Lithium Batteries"
	},
    
    {
	 "date": "14-Apr-16",
	 "category": "Spotlights",
	 "name": "Advanced Cathode Materials for High Performance Lithium Sulphur Batteries",
	 "lenArticle": "PhD Qualifying Examination by Soumyadip MAJUMDER on 14 April 2016 in Rm 1504 (lifts 25-26) at 10:00. Title: Advanced Cathode Materials for High Performance Lithium Sulphur Batteries"
	},
    
    {
	 "date": "03-Mar-16",
	 "category": "Spotlights",
	 "name": "Towards controlled self-assembly preparation for composite materials and the Electrochemical Impedance Spectroscopy diagnosis for fuel cells",
	 "lenArticle": "Seminar by Prof. Jian-Wei Guo on 3 March 2016 in Rm 4502 at 11:00. Title: Towards controlled self-assembly preparation for composite materials and the Electrochemical Impedance Spectroscopy diagnosis for fuel cells"
	},
    
    {
	 "date": "25-Feb-16",
	 "category": "Spotlights",
	 "name": "Leading the Future of Global Scientists",
	 "lenArticle": "Joint Seminar of Department of Chemical and Biomolecular Engineering and Department of Chemistry by Prof. Rafael Luque on 25 February 2016 in Rm 4504 at 10:30. Title: Leading the Future of Global Scientists"
	},
    
    {
	 "date": "24-Feb-16",
	 "category": "Spotlights",
	 "name": "Polymeric Nanoparticles for Co-delivery of Peptidyl Inhibitors into the Central Nervous System",
	 "lenArticle": "PhD Qualifying Examination by Teng FENG on 24 February 2016 in Rm 3588 (lifts 27-28) at 10:00. Title: Polymeric Nanoparticles for Co-delivery of Peptidyl Inhibitors into the Central Nervous System"
	},
    
    {
	 "date": "03-Feb-16",
	 "category": "Spotlights",
	 "name": "Mechanism Study of Carbon Nanotube Reinforced Ultra-High Molecular Weight Polyethylene Fibers",
	 "lenArticle": "PhD Qualifying Examination by Tam Yee Kam Daphne on 3 February 2016 in Rm 5501 (lifts 25-26) at 16:00. Title: Mechanism Study of Carbon Nanotube Reinforced Ultra-High Molecular Weight Polyethylene Fibers"
	},
    
    {
	 "date": "27-Jan-16",
	 "category": "Spotlights",
	 "name": "Surface-modified Graphene-based Materials for Environmental Treatment and Energy Storage",
	 "lenArticle": "PhD Qualifying Examination by Minghao ZHUANG on 27 January 2016 in Rm 6573 (lifts 29-30) at 14:00. Title: Surface-modified Graphene-based Materials for Environmental Treatment and Energy Storage"
	},
    
    {
	 "date": "26-Jan-16",
	 "category": "Spotlights",
	 "name": "Optimization Models for Utility Distribution System",
	 "lenArticle": "PhD Qualifying Examination by Yingzong LIANG on 26 January 2016 in Rm 6573 (lifts 29-30) at 10:00. Title: Optimization Models for Utility Distribution System"
	},
    
    {
	 "date": "19-Jan-16",
	 "category": "Spotlights",
	 "name": "Mechanism of ocular barriers modulation by low-intensity low-frequency ultrasound on sclera and retinal pigment epithelium",
	 "lenArticle": "PhD Thesis Presentation by Wai Leung Langston SUEN on 19 January 2016 in Chen Kuan Cheng Forum (LTH) at 14:00. Title: Mechanism of ocular barriers modulation by low-intensity low-frequency ultrasound on sclera and retinal pigment epithelium"
	},
    
    {
	 "date": "15-Jan-16",
	 "category": "Spotlights",
	 "name": "Electrocatalysts for Hydrogen Evolution and Oxidation Reactions",
	 "lenArticle": "PhD Qualifying Examination by Lulu ZHANG on 15 January 2016 in Rm 6602 (lifts 31-32) at 14:00. Title: Electrocatalysts for Hydrogen Evolution and Oxidation Reactions"
	},
    
    {
	 "date": "15-Jan-16",
	 "category": "Spotlights",
	 "name": "Electrocatalysts for Hydrogen Evolution and Oxidation Reactions",
	 "lenArticle": "PhD Qualifying Examination by Lulu ZHANG on 15 January 2016 in Rm 6602 (lifts 31-32) at 14:00. Title: Electrocatalysts for Hydrogen Evolution and Oxidation Reactions"
	},
    
     {
	 "date": "15-Jan-16",
	 "category": "Spotlights",
	 "name": "Synthesis, formulation and application of copper-based conductive inks and pastes",
	 "lenArticle": "PhD Thesis Presentation by Sze Kee TAM on 15 January 2016 in Rm 6602 (lifts 31-32)at 10:00. Title: Synthesis, formulation and application of copper-based conductive inks and pastes"
	},
    
    {
	 "date": "12-Jan-16",
	 "category": "Spotlights",
	 "name": "Electrocatalysts for Unitized Regenerative Fuel Cells",
	 "lenArticle": "Seminar by Prof. Victoria Martinez Huerta on 12 January 2016 in Rm 4577 at 14:30. Title: Electrocatalysts for Unitized Regenerative Fuel Cells"
	},
    
    {
	 "date": "12-Jan-16",
	 "category": "Spotlights",
	 "name": "The Effect of Ruthenium content on the Service Lifetime of Ti/RuO2-Sb2O5-SnO2 DSA for Oxygen Evolution",
	 "lenArticle": "MPhil Thesis Presentation by Jiaying LI on 12 January 2016 in Room 6573 at 14:00. Title: The Effect of Ruthenium content on the Service Lifetime of Ti/RuO2-Sb2O5-SnO2 DSA for Oxygen Evolution"
	},
    
    {
	 "date": "12-Jan-16",
	 "category": "Spotlights",
	 "name": "New architecture for Self-humidifying Proton Exchange Membrane",
	 "lenArticle": "PhD Thesis Presentation by Viola SIM on 12 January 2016 in Room 6573 at 10:00. Title: New architecture for Self-humidifying Proton Exchange Membrane"
	},
    
    {
	 "date": "08-Jan-16",
	 "category": "Spotlights",
	 "name": "Computational Advances and Challenges in Proteomics",
	 "lenArticle": "Joint Seminar by Department of Chemical and Biomolecular Engineering and Division of Biomedical Engineering on 8 January 2016 in Room 6573 at 14:00. Speaker: Prof. Alexey I. Nesvizhskii, University of Michigan, Ann Arbor. Title: Computational Advances and Challenges in Proteomics"
	},
    
    {
	 "date": "08-Jan-16",
	 "category": "Spotlights",
	 "name": "Catalysts and catalytic processes scale-up at Teesside University",
	 "lenArticle": "Seminar by Prof. Maria Olea on 8 January 2016 in Rm5564 at 10:30am. Title: Catalysts and catalytic processes scale-up at Teesside University"
	},
    
    {
	 "date": "23-Dec-15",
	 "category": "Spotlights",
	 "name": " Design and synthesis of hierarchical porous carbon for CO2 capture and oxygen reduction and evolution catalysis",
	 "lenArticle": "Seminar by Prof. John W.F. To on 23 December 2015 in Rm 4577 at 14:00. Title: Design and synthesis of hierarchical porous carbon for CO2 capture and oxygen reduction and evolution catalysis"
	},
    
    {
	 "date": "18-Dec-15",
	 "category": "Spotlights",
	 "name": "Integrated Research on Waste PCBs Recycle and Utilization",
	 "lenArticle": "PhD Qualifying Examination by Chao NING on 18 December 2015 in Rm 5560 (lifts 28-28) at 14:00. Title: Integrated Research on Waste PCBs Recycle and Utilization"
	},
    
    {
	 "date": "18-Dec-15",
	 "category": "Spotlights",
	 "name": "Synthesis of Three Dimensional Graphene for Sorption of Oils and Organic Solvents",
	 "lenArticle": "MPhil Thesis Presentation by Muhammad Adil RIAZ on 18 December 2015 in Rm 5583 at 10:00. Title: Synthesis of Three Dimensional Graphene for Sorption of Oils and Organic Solvents"
	},
    
    {
	 "date": "10-Dec-15",
	 "category": "Spotlights",
	 "name": "Advancing Metabolic Engineering through Protein Engineering and Synthetic Biology",
	 "lenArticle": "Seminar by Yajun Yan on 10 December 2015 in Chen Kuan Cheng Lecture Theatre (LTH) at 10:30. Title: Advancing Metabolic Engineering through Protein Engineering and Synthetic Biology"
	},
    
    {
	 "date": "08-Dec-15",
	 "category": "Spotlights",
	 "name": "Constructing Renewable Energy Systems via a Paradigm-Shifting Biomanufacturing Platform in vitro Synthetic (Enzymatic) Systems",
	 "lenArticle": "Seminar by Professor Yi Heng Percival Zhang on 8 December 2015 in Room 1505 at 10:30. Title: Constructing Renewable Energy Systems via a Paradigm-Shifting Biomanufacturing Platform in vitro Synthetic (Enzymatic) Systems"
	},
    
    {
	 "date": "26-Nov-15",
	 "category": "Spotlights",
	 "name": "Development of Transition Metal-Loaded Zr-SBA-15 Catalysts for the Selective Catalytic Reduction of NO with Propane in Lean-Burn Engine Exhaust",
	 "lenArticle": "PhD Thesis Presentation by Aghil SABBAGHI on 26 November 2015 in Room 2304 (lifts 17-18) at 15:00. Title: Development of Transition Metal-Loaded Zr-SBA-15 Catalysts for the Selective Catalytic Reduction of NO with Propane in Lean-Burn Engine Exhaust"
	},
    
    {
	 "date": "25-Nov-15",
	 "category": "Spotlights",
	 "name": "Brain Delivery of Drugs and Transport across the BBB by Nanoparticles: Application to Anticancer drugs, NGF for Stroke Treatment and Alzheimer Parkinson Models. Speaker: Prof. Jorg KREUTER, Institut fur Pharmazeutische Technologie Goethe Universitat, Frankfurt, Germany",
	 "lenArticle": "Joint Seminar with Division of Biomedical Engineering on 25 November 2015 in LTH at 14:00. Title: Brain Delivery of Drugs and Transport across the BBB by Nanoparticles: Application to Anticancer drugs, NGF for Stroke Treatment and Alzheimer Parkinson Models. Speaker: Prof. Jorg KREUTER, Institut fur Pharmazeutische Technologie Goethe Universitat, Frankfurt, Germany"
	},
    
    {
	 "date": "25-Nov-15",
	 "category": "Spotlights",
	 "name": "Polymeric nanoparticles for intracellular drug delivery",
	 "lenArticle": "PhD Thesis Presentation by Junli ZHOU on 25 November 2015 in Room 1505 at 10:00. Title: Polymeric nanoparticles for intracellular drug delivery"
	},
    
    {
	 "date": "23-Nov-15",
	 "category": "Spotlights",
	 "name": "Synthetic Biology Approaches toward New Materials with Potential in Regenerative Biology",
	 "lenArticle": "PhD Qualifying Examination by Yujie CAO on 23 Novembere 2015 in Room 3588 (lifts 27-28) at 14:00. Title: Synthetic Biology Approaches toward New Materials with Potential in Regenerative Biology"
	},
    
    {
	 "date": "19-Nov-15",
	 "category": "Spotlights",
	 "name": "Synthesis of porous organic-inorganic hybrid materials and their applications in batteries",
	 "lenArticle": "PhD Qualifying Examimation by Yuanzhong TAN on 19 November 2015 in Room 4475 (lifts 25-26). Title: Synthesis of porous organic-inorganic hybrid materials and their applications in batteries"
	},
    
    {
	 "date": "18-Nov-15",
	 "category": "Spotlights",
	 "name": "Unusual assembly/tailoring logics underlying the biosynthesis of peptide alkaloids in Streptomyces. Speaker: Prof. Yi YU, School of Pharmaceutical Sciences, Wuhan University",
	 "lenArticle": "Joint seminar with Division of Biomedical Engineering on 18 November 2015 in Chen Kuan Cheng Forum (LTH) at 14:00. Title: Unusual assembly/tailoring logics underlying the biosynthesis of peptide alkaloids in Streptomyces. Speaker: Prof. Yi YU, School of Pharmaceutical Sciences, Wuhan University"
	},
    
    {
	 "date": "18-Nov-15",
	 "category": "Spotlights",
	 "name": "Synthesis, characterization and applications of various monodisperse metal oxide nanoparticles via one-pot pyrolysis",
	 "lenArticle": "PhD Qualifying Examination by Qianqian DOU on 18 November 2015 in Room 4577 at 10:00. Title: Synthesis, characterization and applications of various monodisperse metal oxide nanoparticles via one-pot pyrolysis"
	},
    
    {
	 "date": "17-Nov-15",
	 "category": "Spotlights",
	 "name": "Synthesis, characterization and functionalization of various copper chalcogenide nanoparticles for the application of solar control glazing",
	 "lenArticle": "PhD Qualifying Examination by Shaqi GE on 17 November 2016 in Room 4577 at 10:00. Title: Synthesis, characterization and functionalization of various copper chalcogenide nanoparticles for the application of solar control glazing"
	},
    
    {
	 "date": "29-Oct-15",
	 "category": "Spotlights",
	 "name": "Synthesis and modification of biopolymers for use as binders for Lithium-ion battery anodes and performance evaluation",
	 "lenArticle": "PhD Qualifying Examination by Arindam HALDAR on 29 October 2015 in Room 1505 (lifts 25-26) at 14:30. Title: Synthesis and modification of biopolymers for use as binders for Lithium-ion battery anodes and performance evaluation"
	},
    
    {
	 "date": "29-Oct-15",
	 "category": "Spotlights",
	 "name": "Intrinsic Conductive Polymers Coating on Cathode Materials by Oxidative Chemical Vapor Deposition for Advanced Lithium Ion Batteries.",
	 "lenArticle": "PhD Qualifying Examination by Qiang LIU on 29 October 2015 in Room 5560 (lifts 27-28) at 10:00. Title: Intrinsic Conductive Polymers Coating on Cathode Materials by Oxidative Chemical Vapor Deposition for Advanced Lithium Ion Batteries."
	},
    
    {
	 "date": "13-Oct-15",
	 "category": "Spotlights",
	 "name": "Smart materials from sustainable biopolymers",
	 "lenArticle": "Seminar by Prof. Kai Zhang on 13 October 2015 in Room 5583 (lifts 27-28) at 14:30. Title: Smart materials from sustainable biopolymers"
	},
    
    {
	 "date": "13-Oct-15",
	 "category": "Spotlights",
	 "name": "Exploring LiF-based Composites as High Energy Density Cathode Materials for Li-ion Batteries",
	 "lenArticle": "PhD Qualifying Examination by Leiting ZHANG on 13 October 2015 in Room 4577 (lifts 27-28) at 09:00. Title: Exploring LiF-based Composites as High Energy Density Cathode Materials for Li-ion Batteries"
	},
    
    {
	 "date": "06-Oct-15",
	 "category": "Spotlights",
	 "name": "",
	 "lenArticle": "Seminar by Dr Xiaolei Fan on 6 October 2015 in Rm 1504 (lifts 25-26) at 14:00. Metal-organic frameworks for CO2 adsorption: understanding the hydrothermal stability and structural defects, a case study of Cu3(BTC)2 framework"
	},
    
    {
	 "date": "18-Sep-15",
	 "category": "Spotlights",
	 "name": "Development and field testing of smart antimicrobial coating",
	 "lenArticle": "PhD Thesis Presentation by Hong Hang LEUNG on 18 September 2015 in Room 4577 (lifts 27-28) at 10:30. name: Development and field testing of smart antimicrobial coating"
	},
    
    {
	 "date": "04-Sep-15",
	 "category": "Spotlights",
	 "name": "Coiled Flow Inverter: A Novel Device",
	 "lenArticle": "Seminar by Krishna.D.P. NIGAM on 4 September 2015 in Room 4620 (lifts 31-32) at 16:30. Title: Coiled Flow Inverter: A Novel Device"
	},
    
    {
	 "date": "04-Sep-15",
	 "category": "Spotlights",
	 "name": "Modifications to Li-Rich Layered Oxide for Lithium-Ion Batteries Cathode",
	 "lenArticle": "PhD Thesis Presentation by Hongjie XU on 4 September 2015 in Room 4577 (lifts 27-28) at 14:00. Title: Modifications to Li-Rich Layered Oxide for Lithium-Ion Batteries Cathode"
	},
    
    {
	 "date": "02-Sep-15",
	 "category": "Spotlights",
	 "name": "Electricity-assisted Antifouling Ceramic Membrane Modified by Magneli Titanium Sub-oxides for Environmental and Biological Applications",
	 "lenArticle": "PhD Thesis Presentation by Ping GENG on 2 September 2015 in Room 4577 at 15:30. Title: Electricity-assisted Antifouling Ceramic Membrane Modified by Magneli Titanium Sub-oxides for Environmental and Biological Applications"
	},
    
    {
	 "date": "31-Aug-15",
	 "category": "Spotlights",
	 "name": "Control and Optimization of Self-assembly Two Investigated Model Systems: DNA and Colloid",
	 "lenArticle": "PhD Qualifying Examination by Yu GAO on 31 August 2015 in Room 4577 (lifts 27-28) at 15:00. Title: Control and Optimization of Self-assembly Two Investigated Model Systems: DNA and Colloid"
	},
    
    {
	 "date": "31-Aug-15",
	 "category": "Spotlights",
	 "name": "Surface Mobility and Surface Equilibrium Structure of Polymer Studied by Time-of-flight Secondary Ion Mass Spectrometry, Contact Angle Measurement and Molecular Dynamics Simulation",
	 "lenArticle": "PhD Qualifying Examination by Jermery Chi Pui WONG on 31 August 2015 in Room 6573 (lifts 29-30) at 14:00. Title: Surface Mobility and Surface Equilibrium Structure of Polymer Studied by Time-of-flight Secondary Ion Mass Spectrometry, Contact Angle Measurement and Molecular Dynamics Simulation"
	},
    
    {
	 "date": "31-Aug-15",
	 "category": "Spotlights",
	 "name": "Surface Mobility and Surface Equilibrium Structure of Polymer Studied by Time-of-flight Secondary Ion Mass Spectrometry, Contact Angle Measurement and Molecular Dynamics Simulation",
	 "lenArticle": "PhD Qualifying Examination by Jermery Chi Pui WONG on 31 August 2015 in Room 6573 (lifts 29-30) at 14:00. Title: Surface Mobility and Surface Equilibrium Structure of Polymer Studied by Time-of-flight Secondary Ion Mass Spectrometry, Contact Angle Measurement and Molecular Dynamics Simulation"
	},
    
    {
	 "date": "31-Aug-15",
	 "category": "Spotlights",
	 "name": " Process optimization and control: from single agent to multi-agent cooperation for performances enhancement",
	 "lenArticle": "PhD Qualifying Examination by QU Hongyi on 31 August 2015 in Room 6573 (lifts 29-30) at 10:00. Title: Process optimization and control: from single agent to multi-agent cooperation for performances enhancement"
	},
    
    {
	 "date": "21-Aug-15",
	 "category": "Spotlights",
	 "name": " Angle-dependent Reactivity for the Chemical Modification by Diazonium Salts on Bilayer Graphene",
	 "lenArticle": "MPhil Thesis Presentation by Yao DING on 21 August 2015 in Room 4577 (lifts 27-28) at 10:00. Title: Angle-dependent Reactivity for the Chemical Modification by Diazonium Salts on Bilayer Graphene"
	},
    
    {
	 "date": "20-Aug-15",
	 "category": "Spotlights",
	 "name": "Utilization and Characteization of Photosynthetic Bacteria Rhodobacter Sphaeroides for Bioelectricity Generation",
	 "lenArticle": "MPhil Thesis Presentation by Man Tung WONG on 20 August 2015 in Room 6573 at 10:00. Title: Utilization and Characterization of Photosynthetic Bacteria Rhodobacter Sphaeroides for Bioelectricity Generation"
	},
    
    {
	 "date": "18-Aug-15",
	 "category": "Spotlights",
	 "name": "Model Migration Methodologies Using Bayesian Statistical Adjustments",
	 "lenArticle": "PhD Thesis Presentation by Linkai Luo on 18 August 2015 in Room 6573 (lifts 29-30) at 14:00. Title: Model Migration Methodologies Using Bayesian Statistical Adjustments"
	},
    
    {
	 "date": "18-Aug-15",
	 "category": "Spotlights",
	 "name": "Modelling, Integration and Optimization of a Heat Integrated Gasification Process",
	 "lenArticle": "MPhil Thesis Presentation by Yi ZHU on 18 August 2015 in Room 6573 (lifts 29-30) at 10:00. Title: Modelling, Integration and Optimization of a Heat Integrated Gasification Process"
	},
    
    {
	 "date": "14-Aug-15",
	 "category": "Spotlights",
	 "name": "Antimicrobial An Anti-adhesion Coating on Water Filtration Membrane",
	 "lenArticle": "MPhil Thesis Presentation by Hiu Pang YU on 14 August 2015 in Room 6573 (lifts 29-30) at 10:00. Title: Antimicrobial An Anti-adhesion Coating on Water Filtration Membrane"
	},
    
    {
	 "date": "14-Aug-15",
	 "category": "Spotlights",
	 "name": "Process modelling and optimization for bioproducts generation from microalgae",
	 "lenArticle": "PhD Qualifying Examination by Ergys PAHIJA on 14 August 2015 in Room 4577 (lifts 27-28) at 10:00. Title: Process modelling and optimization for bioproducts generation from microalgae"
	},
    
    {
	 "date": "13-Aug-15",
	 "category": "Spotlights",
	 "name": "Graphene Aerogels and Composites: Applications in Air Purification",
	 "lenArticle": "PhD Qualifying Examination by Weiyang CHEN on 13 August 2015 in Room 6573 (lifts 27-28) at 10:00. Title: Graphene Aerogels and Composites: Applications in Air Purification"
	},
    
    {
	 "date": "12-Aug-15",
	 "category": "Spotlights",
	 "name": "Aerogel Catalyst for Selective Oxidation of Ammonia",
	 "lenArticle": "PhD Thesis Presentation by Hao CHEN on 12 August 2015 in Room 6573 (lifts 29-30) at 10:00. Title: Aerogel Catalyst for Selective Oxidation of Ammonia"
	},
    
    {
	 "date": "07-Aug-15",
	 "category": "Spotlights",
	 "name": "TiO2 Dye-Sensitized Solar Cells (DSSCs)",
	 "lenArticle": "MPhil Thesis Examination by Tsz Cheung TSUI on 7 August 2015 in Room 6573 (lifts 29-30) at 10:00. Title: TiO2 Dye-Sensitized Solar Cells (DSSCs)"
	},
    
    {
	 "date": "28-Jul-15",
	 "category": "Spotlights",
	 "name": "Characterization of Hazardous Materials: Flammability and Reactivity",
	 "lenArticle": "IAS/SENG/CBME Lecture by Prof. Daniel Crowl on 28 July 2015 in Cheung On Tak Lecture Theater (LTE) at 16:00. Title: Characterization of Hazardous Materials: Flammability and Reactivity"
	},
    
    {
	 "date": "24-Jul-15",
	 "category": "Spotlights",
	 "name": "Publishing Development Director, Science, Technology and Medicine",
	 "lenArticle": "Seminar by Dr Philip Meyler on 24 July 2015 in Chen Kuan Cheng Forum (LTH) at 10:00. Title: Publishing Development Director, Science, Technology and Medicine"
	},
    
    {
	 "date": "23-Jul-15",
	 "category": "Spotlights",
	 "name": "Selective Fluidic Transport under Nanoconfinement: The Conventional and Unconventional Wisdom",
	 "lenArticle": "Seminar by Professor Zhiping XU on 23 July 2015 in Rm 4577 (lifts 27-28) at 14:00. Title: Selective Fluidic Transport under Nanoconfinement: The Conventional and Unconventional Wisdom"
	},
    
    {
	 "date": "22-Jul-15",
	 "category": "Spotlights",
	 "name": "Simultaneous Optimization and Integration of IGCC system",
	 "lenArticle": "PhD Qualifying Examination by Maojian WANG on 22 July 2015 in Room 4616 (lifts 31-32) at 10:00. Title: Simultaneous Optimization and Integration of IGCC system"
	},
    
    {
	 "date": "17-Jul-15",
	 "category": "Spotlights",
	 "name": "Environmental Catalysts for Treatment of VOC-related Malodor",
	 "lenArticle": "PhD Qualifying Examination by Qingyue WANG on 17 July in Room 4577 (lifts 27-28)at 14:00. Title: Environmental Catalysts for Treatment of VOC-related Malodor"
	},
    
    {
	 "date": "16-Jul-15",
	 "category": "Spotlights",
	 "name": "Metal Organic Framework Materials in Microfluidics Systems",
	 "lenArticle": "PhD Qualifying Examination by Kailin HE on 16 July in Room 4577 (lifts 27-28) at 14:00. Title: Metal Organic Framework Materials in Microfluidics Systems"
	},
    
    {
	 "date": "24-Jun-15",
	 "category": "Spotlights",
	 "name": "Probing the Structure and Dynamic Behaviors of Nanostructured Materials with Atomic Resolution in Real Time",
	 "lenArticle": "IAS/CBME Distinguished Lecture by Prof. Xiaoqing Pan on 24 June 2015 in Leung Yat Sing Lecture Theater(LTF)at 15:30, Title: Probing the Structure and Dynamic Behaviors of Nanostructured Materials with Atomic Resolution in Real Time"
	},
    
    {
	 "date": "24-Jun-15",
	 "category": "Spotlights",
	 "name": "Magnetically Separable SBA15-based Metallic Catalysts for Selective Organic Transformation from Benzyl Alcohol to Benzaldehyde",
	 "lenArticle": "PhD Qualifying Exmination by Yingying LI on 24 June 2015 in Room 4577 (lifts 27-28) at 10:00. Title: Magnetically Separable SBA15-based Metallic Catalysts for Selective Organic Transformation from Benzyl Alcohol to Benzaldehyde"
	},
    
    {
	 "date": "23-Jun-15",
	 "category": "Spotlights",
	 "name": "Functionality of Nanostructured Titanium Oxide Surfaces for SERS and Raman Imaging",
	 "lenArticle": "PhD Qualifying Examination by IRFAN H. ABIDI on 23 June 2015 in Room 4577 at 14:30. Title: Functionality of Nanostructured Titanium Oxide Surfaces for SERS and Raman Imaging"
	},
    
    {
	 "date": "19-Jun-15",
	 "category": "Spotlights",
	 "name": "Toward a Distributed and Renewable electrochemical Energy and Mobility System (DREEMS): Polymer Electrolytes and Electrocatalysis",
	 "lenArticle": "IAS/CBME/EI Joint Distinguished Lecture by Yushan YAN on 19 June 2015 in Chow Tak Sin Lecture Theatre (LTG)at 10:00. Title: Toward a Distributed and Renewable electrochemical Energy and Mobility System (DREEMS): Polymer Electrolytes and Electrocatalysis"
	},
    
    {
	 "date": "17-Jun-15",
	 "category": "Spotlights",
	 "name": "Microfluidics for Transdermal Drug Delivery",
	 "lenArticle": "PhD Qualifying Examination by Baihua ZHONG on 17 June 2015 at 10:00 in Room 4577. Title: Microfluidics for Transdermal Drug Delivery"
	},
    
    {
	 "date": "16-Jun-15",
	 "category": "Spotlights",
	 "name": "In-situ Label-free Monitoring of Shewanella oneidensis MR-1 Biofilm Formation on Different Electrode Materials during Bacterial Electrogenesis Using Scanning Electrochemical Microscopy",
	 "lenArticle": "MPhil Thesis Presentation by Wenjia ZHANG on 16 June 2015 in Room 4577 at 09:30. Title: In-situ Label-free Monitoring of Shewanella oneidensis MR-1 Biofilm Formation on Different Electrode Materials during Bacterial Electrogenesis Using Scanning Electrochemical Microscopy"
	},
    
    {
	 "date": "11-Jun-15",
	 "category": "Spotlights",
	 "name": "Data-driven modelling to assist the implementation of Quality-by-Design paradigms in pharmaceutical development and manufacturing",
	 "lenArticle": "Seminar by Fabrizio Bezzo on 11 June 2015 in Room 4577 at 14:00. Title: Data-driven modelling to assist the implementation of Quality-by-Design paradigms in pharmaceutical development and manufacturing"
	},
    
    {
	 "date": "02-Jun-15",
	 "category": "Spotlights",
	 "name": "Sulfur and Sulfides for Rechargeable Lithium-Sulfur Batteries",
	 "lenArticle": "Seminar by Jiazhao WANG on 2 June 2015 in Room 4577 at 11:00. Title: Sulfur and Sulfides for Rechargeable Lithium-Sulfur Batteries"
	},
    
    {
	 "date": "20-May-15",
	 "category": "Spotlights",
	 "name": "Preparation of Dimensionally Stable UHMWPE Composite Membranes for Fuel Cell Applications",
	 "lenArticle": "PhD Qualifying Examination by Runlai LI on 20 May 2015 in Room 4577 at 10:00. Title: Preparation of Dimensionally Stable UHMWPE Composite Membranes for Fuel Cell Applications"
	},
    
    {
	 "date": "24-Apr-15",
	 "category": "Spotlights",
	 "name": "Thermal & Battery Management System Design and Optimization for Power Lithium-ion Battery",
	 "lenArticle": "Joint seminar (with HKUST Energy Institute) by Prof. Zifeng MA on 24 April in LTH at 10:30. Title: Thermal & Battery Management System Design and Optimization for Power Lithium-ion Battery"
	},
    
    {
	 "date": "27-Mar-15",
	 "category": "Spotlights",
	 "name": "Metabolic Flux Analysis for Engineers",
	 "lenArticle": "Seminar by Prof. John Villadsen on 27 March 2015 in Room 5619 at 15:00. Title: Metabolic Flux Analysis for Engineers"
	},
    
    {
	 "date": "25-Mar-15",
	 "category": "Spotlights",
	 "name": "Mechanistic Studies and Theoretical Understanding of Polymer Entanglements in the Case of Ultra-high Molecular Weight Polyethylene Gel",
	 "lenArticle": "PhD Qualifying Examination by Siu Yeung CHEUNG on 25 March 2015 in Room 4577 at 10:00 am. Title: Mechanistic Studies and Theoretical Understanding of Polymer Entanglements in the Case of Ultra-high Molecular Weight Polyethylene Gel"
	},
    
    {
	 "date": "27-Mar-15",
	 "category": "Spotlights",
	 "name": "Metabolic Flux Analysis for Engineers",
	 "lenArticle": "Seminar by Prof. John Villadsen on 27 March 2015 in Room 5619 at 15:00. Title: Metabolic Flux Analysis for Engineers"
	},
    
    {
	 "date": "12-Mar-15",
	 "category": "Spotlights",
	 "name": "From black to green footprints via advanced catalysis",
	 "lenArticle": "Seminar by Professor Maria Olea on 12 March 2015 in Room 1504 at 10:00 am. Title: From black to green footprints via advanced catalysis"
	},
    
    {
	 "date": "09-Mar-15",
	 "category": "Spotlights",
	 "name": "High Temperature Membranes for Carbon Dioxide Capture",
	 "lenArticle": "Seminar by Jerry Y.S. Lin on 9 March 2015 in Room 1504 at 10:00 am. Title: High Temperature Membranes for Carbon Dioxide Capture"
	},
    
    {
	 "date": "05-Mar-15",
	 "category": "Spotlights",
	 "name": "Microfluidics assisted irreversible Gelation in Wormlike Micellar Solutions",
	 "lenArticle": "Seminar by Professor Amy Shen on 5 March 2015 in Room 4577 at 16:30. Title: Microfluidics assisted irreversible Gelation in Wormlike Micellar Solutions"
	},
    
    {
	 "date": "23-Feb-15",
	 "category": "Spotlights",
	 "name": "Graphene Field Effect Transistor Sensor in Paper Microfluidic Channel",
	 "lenArticle": "PhD Qualifying Examination by CAGANG, Aldrine Abenoja on 23 February 2015 in Room 5559 at 14:00. Title: Graphene Field Effect Transistor Sensor in Paper Microfluidic Channel"
	},
    
    {
	 "date": "16-Feb-15",
	 "category": "Spotlights",
	 "name": "Process Development in Synthesis and Recycle of Lithium Ion Battery Cathode Material",
	 "lenArticle": "PhD Thesis Presentation by Guoqiang CAI on 16 February 2015 in Room 4577 at 16:30. Title: Process Development in Synthesis and Recycle of Lithium Ion Battery Cathode Material"
	},
    
    {
	 "date": "16-Feb-15",
	 "category": "Spotlights",
	 "name": "Highly Thermal and Electrical Conductive Composites with Connected Filler Networks: Preparation, Characterization",
	 "lenArticle": "PhD Thesis Presentation by Mingchang HU on 16 February 2015 in Room 4577 at 14:00. Title: Highly Thermal and Electrical Conductive Composites with Connected Filler Networks: Preparation, Characterization"
	},
    
    {
	 "date": "13-Feb-15",
	 "category": "Spotlights",
	 "name": "Virucidal Activity and Mechanism of Smart Antimicrobial Surface Coating",
	 "lenArticle": "PhD Thesis Presentation by Qing CHANG on 13 February 2015 in Room 4577 at 14:30. Title: Virucidal Activity and Mechanism of Smart Antimicrobial Surface Coating"
	},
    
    {
	 "date": "10-Feb-15",
	 "category": "Spotlights",
	 "name": "CVD graphene preparation, oxidation-assisted transfer and nanoelectronics fabrication",
	 "lenArticle": "PhD Qualifying Examination by Ruizhe WU on 10 February 2015 in Room 4577 at 10:00 am. Title: CVD graphene preparation, oxidation-assisted transfer and nanoelectronics fabrication"
	},
    
    {
	 "date": "06-Feb-15",
	 "category": "Spotlights",
	 "name": "",
	 "lenArticle": "Joint Seminar by Department of Chemical and Biomolecular Engineering & Department of Chemistry by Tao Zhang on 6 February 2015 at 15:00 in Room 5619 (lifts 31-32)"
	},
    
    {
	 "date": "05-Feb-15",
	 "category": "Spotlights",
	 "name": "Vacuum-Assisted SILAR Approach to Fabricate the CuInS2/TiO2 Nanotube Electrode with Enhanced Interfacial Charge Transfer Property",
	 "lenArticle": "Seminar by Xinyong Li on 5 February 2015 in Room 1504 at 10:00 am. Title: Vacuum-Assisted SILAR Approach to Fabricate the CuInS2/TiO2 Nanotube Electrode with Enhanced Interfacial Charge Transfer Property"
	},
    
    {
	 "date": "04-Feb-15",
	 "category": "Spotlights",
	 "name": "Graphene-templated Growth of Nanomaterials for Supercapacitors Application",
	 "lenArticle": "PhD Qualifying Examination by Xuewu OU on 4 February 2015 in Room 4577 at 10:00. Title: Graphene-templated Growth of Nanomaterials for Supercapacitors Application"
	}, 
    
    {
	 "date": "27-Jan-15",
	 "category": "Spotlights",
	 "name": "Using modified rice husk for oil sorption",
	 "lenArticle": "MPhil Thesis Presentation by Zhixuan WANG on 27 January 2015 in Room 5583 at 09:00. Title: Using modified rice husk for oil sorption"
	}, 
    
    {
	 "date": "27-Jan-15",
	 "category": "Spotlights",
	 "name": "Nanoscale Flux Imaging: New Perspectives on Electrode Processes, Complex Interfaces and Living",
	 "lenArticle": "Seminar by Patrick Unwin on 27 January 2015 in Room 4502 at 14:00. Title: Nanoscale Flux Imaging: New Perspectives on Electrode Processes, Complex Interfaces and Living"
	},  
    
    {
	 "date": "27-Jan-15",
	 "category": "Spotlights",
	 "name": "Synthesis of Conductive Carbon Nanotubes-epoxy Composite",
	 "lenArticle": "MPhil Thesis Presentation by Kwan Hung CHAN on 27 January 2015 in Room 4577 (lifts 27-28)at 10:00. Title: Synthesis of Conductive Carbon Nanotubes-epoxy Composite"
	}, 
    
    {
	 "date": "23-Jan-15",
	 "category": "Spotlights",
	 "name": "Building and Searching Predicted Spectral Libraries for Identification of Protein Post-translational",
	 "lenArticle": "PhD Thesis Presentation by Yingwei HU on 23 January 2015 in Room 5562 (lifts 27-28) at 15:00. Title: Building and Searching Predicted Spectral Libraries for Identification of Protein Post-translational"
	}, 
    
    {
	 "date": "22-Jan-15",
	 "category": "Spotlights",
	 "name": "Two dimensional batch process control for improved performance and guaranteed stability",
	 "lenArticle": "PhD Qualifying Examination by Jingyi LU on 22 January 2015 in Room 5562 (lifts 27-28) at 10:00. Title: Two dimensional batch process control for improved performance and guaranteed stability"
	}, 
    
    {
	 "date": "22-Jan-15",
	 "category": "Spotlights",
	 "name": "Catalytic and non-catalytic technologies for malodour treatment",
	 "lenArticle": "Mphil Thesis Presentation by Gabriel Kei Bo CHEUNG on 22 January 2015 in Room 4577 at 10:00. Title: Catalytic and non-catalytic technologies for malodour treatment"
	}, 
    
    {
	 "date": "20-Jan-15",
	 "category": "Spotlights",
	 "name": "Techno-economic analysis and evaluation of microalgae process design.",
	 "lenArticle": "MPhil Thesis Presentation by Yu ZHANG on 20 January 2015 in Room 4577 at 10:00. Title: Techno-economic analysis and evaluation of microalgae process design."
	},
    
    {
	 "date": "16-Jan-15",
	 "category": "Spotlights",
	 "name": "Sandwich-Spreading Method to Fabricate and Control Monolayer of Small Organic Molecules",
	 "lenArticle": "PhD Qualifying Examination by Qicheng ZHANG on 16 January 2015 in Room 5583 at 10:30. Title: Sandwich-Spreading Method to Fabricate and Control Monolayer of Small Organic Molecules"
	},
    
    {
	 "date": "16-Jan-15",
	 "category": "Spotlights",
	 "name": "Challenges in Solar Detoxification of Industrial and Urban Wastewater and the Simultaneous Production of Renewable Energy",
	 "lenArticle": "Seminar by Gianluca LI PUMA on 16 January 2015 in Room 5583 (lifts 27-28) at 15:00. Title: Challenges in Solar Detoxification of Industrial and Urban Wastewater and the Simultaneous Production of Renewable Energy"
	},
    
    {
	 "date": "16-Jan-15",
	 "category": "Spotlights",
	 "name": "Molecular Dynamics Studies of Graphene-DNA Interactions",
	 "lenArticle": "PhD Qualifying Examination by Abhishek TYAGI on 16 January 2015 in Room 5583 at 09:00. Title: Molecular Dynamics Studies of Graphene-DNA Interactions"
	},
    
    {
	 "date": "15-Jan-15",
	 "category": "Spotlights",
	 "name": "Point-of-Use Pulsed Electric Field Device for On-Site Disinfection of Water",
	 "lenArticle": "MPhil Thesis Presentation by Oi Wa LEE on 15 January 2014 in Room 4577 at 10:00. Title: Point-of-Use Pulsed Electric Field Device for On-Site Disinfection of Water"
	},
    
    {
	 "date": "14-Jan-15",
	 "category": "Spotlights",
	 "name": "Flow Synthesis and Positioning of Porous Material in Microreactor",
	 "lenArticle": "PhD Thesis Presentation by Tsz Nok NG on 14 January 2015 in Room 4577 at 15:30. Title: Flow Synthesis and Positioning of Porous Material in Microreactor"
	},
    
    {
	 "date": "13-Jan-15",
	 "category": "Spotlights",
	 "name": "Nucleic Acid Based Nanostructures for Cellular Delivery",
	 "lenArticle": "PhD Qualifying Examination by Tsz Wing FAN on 13 January 2015 in Room 4577 at 15:00. Title: Nucleic Acid Based Nanostructures for Cellular Delivery"
	},
    
    {
	 "date": "13-Jan-15",
	 "category": "Spotlights",
	 "name": "Antibiotics Resistance Study in Staphylococcus aureus by Label-free Quantitative Proteomics",
	 "lenArticle": "PhD Thesis Presentation by Xiaofen LIU on 13 January 2014 in Room 6573 (lift 32) at 10:00. Title: Antibiotics Resistance Study in Staphylococcus aureus by Label-free Quantitative Proteomics"
	},
    
    {
	 "date": "30-Dec-14",
	 "category": "Spotlights",
	 "name": "Heterogeneous catalysts for selective organic transformations",
	 "lenArticle": "PhD Qualifying Examination by Yingying LI on 30 December 2014 in Room 4577 at 14:30. Title: Heterogeneous catalysts for selective organic transformations"
	},
    
    {
	 "date": "29-Dec-14",
	 "category": "Spotlights",
	 "name": "Functional materials for organic transformation from carbohydrates to furan based compounds",
	 "lenArticle": "PhD Qualifying Examination by Amrita CHATTERJEE on 29 December 2014 in Room 4577 at 14:00. Title: Functional materials for organic transformation from carbohydrates to furan based compounds"
	},
    
    {
	 "date": "23-Dec-14",
	 "category": "Spotlights",
	 "name": "Nanoalloy Catalysts and Functional Nanoparticle Assemblies",
	 "lenArticle": "Seminar by Chuan-Jian ZHONG on 23 December 2014 in Chen Kuan Cheng Lecture Theatre (H) at 14:00. Title: Nanoalloy Catalysts and Functional Nanoparticle Assemblies"
	},
    
    {
	 "date": "23-Dec-14",
	 "category": "Spotlights",
	 "name": "Synthesis & Application of Porous Polyolefin Films",
	 "lenArticle": "PhD Thesis Presentation by Junaid Saleem on 23 December 2014 in Room 4115A (lift 19) at 10:00. Title: Synthesis & Application of Porous Polyolefin Films"
	},
    
    {
	 "date": "12-Dec-14",
	 "category": "Spotlights",
	 "name": "Interfacial Assembly and Engineering of Ordered Mesoporous Materials for applications",
	 "lenArticle": "Joint seminar by Dept of Chemistry and Dept of CBME on 12 December 2014 at 15:30 in Room 4115A, 4/F, (lift 19). Speaker: Prof. Dongyuan ZHAO. Title: Interfacial Assembly and Engineering of Ordered Mesoporous Materials for applications"
	},
    
    {
	 "date": "13-Nov-14",
	 "category": "Spotlights",
	 "name": "Production of Valuable Products from Carbonaceous and Siliceous Solid Wastes",
	 "lenArticle": "PhD Thesis Presentation by Alireza Bazargan on 13 November 2014 in Rm. 4115A (Lift 19) at 14:00. Title: Production of Valuable Products from Carbonaceous and Siliceous Solid Wastes"
	},
    
    {
	 "date": "31-Oct-14",
	 "category": "Spotlights",
	 "name": "Chemical Engineering Series III - Chemical Engineering in Water Infrastructure Projects",
	 "lenArticle": "Technical seminar by Ir Harry LEE on 31 October 2014 in Room C0618, The Open University of Hong Kong, 30 Good Shepherd Street, Ho Man Tin at 19:00. Title: Chemical Engineering Series III - Chemical Engineering in Water Infrastructure Projects"
	},
    
    {
	 "date": "20-Oct-14",
	 "category": "Spotlights",
	 "name": "",
	 "lenArticle": "MPhil Thesis presentation by Jinze LI on 20 October in Room 4577 at Department of Chemical and Biomolecular Engineering Hong Kong University of Science and Technology"
	},
    
    {
	 "date": "05-Sep-14",
	 "category": "Spotlights",
	 "name": "Time-of-Flight Secondary Ion Mass Spectrometry for Zeolite Characterization",
	 "lenArticle": "MPhil Thesis Presentation by Felicia Febriana BUDIHARDJO on 5 September 2014 in Room 4577 (lifts 27-28) at 14:30. Title: Time-of-Flight Secondary Ion Mass Spectrometry for Zeolite Characterization"
	},
    
    {
	 "date": "02-Sep-14",
	 "category": "Spotlights",
	 "name": "Product Design of Chinese Herbal Medicine by Understanding of Traditional Manufacturing Process",
	 "lenArticle": "MPhil Thesis Presentation by Qi CHEN on 2 September 2014 in room 4577 (lifts 27-28) at 10:00. Title: Product Design of Chinese Herbal Medicine by Understanding of Traditional Manufacturing Process"
	},
    
    {
	 "date": "29-Aug-14",
	 "category": "Spotlights",
	 "name": "Drainage, Dewetting, and Contamination of Hydrogel Contact Lenses",
	 "lenArticle": "Seminar by Gerald G. Fuller on 29 August 2014 in HKUST Jocket Club Institute of Advanced Study at 15:00. Title: Drainage, Dewetting, and Contamination of Hydrogel Contact Lenses"
	},
    
    {
	 "date": "22-Aug-14",
	 "category": "Spotlights",
	 "name": "Exploration of Li-F Secondary Batteries Based on Layer-Structured Materials",
	 "lenArticle": "PhD Qualifying Examination by Yuebin YANG on 22 August 2014 in Room 4577 (lifts 27-28) at 09:00. Title: Exploration of Li-F Secondary Batteries Based on Layer-Structured Materials"
	},
    
    {
	 "date": "21-Aug-14",
	 "category": "Spotlights",
	 "name": "Real-time Electrochemical Monitoring of Biological Processes Using Scanning Electrochemical Microscopy",
	 "lenArticle": "PhD Qualifying Examination by Wenjia ZHANG on 21 August 2014 in Room 4577 (lifts 27-28) at 15:00. Title: Real-time Electrochemical Monitoring of Biological Processes Using Scanning Electrochemical Microscopy"
	},
    
    {
	 "date": "20-Aug-14",
	 "category": "Spotlights",
	 "name": "Endothelial Cell-Adhesive Injectable Hydrogel as Endovascular Embolizing Agent",
	 "lenArticle": "MPhil Thesis Presentation by Teng FENG on 20 August 2014 in Room 4577 (lifts 27-28) at 15:00. Title: Endothelial Cell-Adhesive Injectable Hydrogel as Endovascular Embolizing Agent"
	},
    
    {
	 "date": "20-Aug-14",
	 "category": "Spotlights",
	 "name": "Photoactive Metal-Titania Nanotubes for Solar Fuel Production",
	 "lenArticle": "PhD Qualifying Examination by Yakub FAM on 20 August 2014 in Room 7341 (lifts 13-15) at 15:00. Title: Photoactive Metal-Titania Nanotubes for Solar Fuel Production"
	},
    
    {
	 "date": "18-Aug-14",
	 "category": "Spotlights",
	 "name": "Homogeneous Electrochemical Platforms for Ultrasensitive and Specific Nucleic Acid Assay",
	 "lenArticle": "PhD Thesis Presentation by Feng XUAN on 18 August 2014 in Chen Kuan Cheng Forum (LTH) at 10:00. Title: Homogeneous Electrochemical Platforms for Ultrasensitive and Specific Nucleic Acid Assay"
	},
    
    {
	 "date": "15-Aug-14",
	 "category": "Spotlights",
	 "name": "Predictive Control Beyond Regulation",
	 "lenArticle": "Joint Seminar by Deparment of Chemical and Biomolecular Engineering and Department of Electronic & Computer Engineering Centre of Polymer Processing and Systems (FYTGS) on 15 August 2014 in Room 5583 at 14:30. Title: Predictive Control Beyond Regulation"
	},
    
    {
	 "date": "13-Aug-14",
	 "category": "Spotlights",
	 "name": "Kinetic Modeling of the Binary Metals Adsorption",
	 "lenArticle": "PhD Qualifying Examination by Len Foong KOONG on 13 August 2014 in Room 4577 (lifts 27-28) at 14:00. Title: Kinetic Modeling of the Binary Metals Adsorption"
	},
    
    {
	 "date": "06-Aug-14",
	 "category": "Spotlights",
	 "name": "Synthesis and Characterization of LiFeSO4F as Novel Cathode Material for Lithium-ion Batteries",
	 "lenArticle": "MPhil Thesis Presentation by Leiting ZHANG on 6 August 2014 in Room 6002 at 09:30. Title: Synthesis and Characterization of LiFeSO4F as Novel Cathode Material for Lithium-ion Batteries"
	},
    
    {
	 "date": "30-Jul-14",
	 "category": "Spotlights",
	 "name": "Synthesis, sulfonic acid functionalization and catalytic application of metal organic frameworks",
	 "lenArticle": "MPhil Thesis Examination by Kai MA on 30 July in Room 5583 (lifts 27-28) at 10:00. Title: Synthesis, sulfonic acid functionalization and catalytic application of metal organic frameworks"
	},
    
    {
	 "date": "25-Jul-14",
	 "category": "Spotlights",
	 "name": "A Polydopamine-coated Sulfur/CMK-3 Composite as a Cathode Material for Lithium-Sulfur Batteries",
	 "lenArticle": "MPhil Thesis Examination by Rui LIANG on 25 July in Room 5583 (lifts 27-28) at 09:00. Title: A Polydopamine-coated Sulfur/CMK-3 Composite as a Cathode Material for Lithium-Sulfur Batteries"
	},
    
    {
	 "date": "11-Jul-14",
	 "category": "Spotlights",
	 "name": "Evolution-traced Multivariate Statistical Process Control for Batch Processes",
	 "lenArticle": "PhD Thesis Examination by Luping ZHAO on 11 July 2014 in Room 6591 (lifts 31-32) at 15:00. Title: Evolution-traced Multivariate Statistical Process Control for Batch Processes"
	},
    
    {
	 "date": "09-Jul-14",
	 "category": "Spotlights",
	 "name": "Bayesian Improved Model Migration Strategy through Optimal Experimental Design",
	 "lenArticle": "PhD Qualifying Examination by Linkai LUO on 9 July in Room 5583 (lifts 27-28) at 10:00. Title: Bayesian Improved Model Migration Strategy through Optimal Experimental Design"
	},
    
    {
	 "date": "08-Jul-14",
	 "category": "Spotlights",
	 "name": "Current Research and Future Prospects of Fuel Cells and Catalyst Development",
	 "lenArticle": "Joint Seminar with HKUST Energy Institute on 8 July in Leung Yat Sing Lecture Theatre (LTF) at 14:00. Title: Current Research and Future Prospects of Fuel Cells and Catalyst Development"
	},
    
    {
	 "date": "08-Jul-14",
	 "category": "Spotlights",
	 "name": "Synthesis, processing and application of metal-based printed electronics nanomaterial",
	 "lenArticle": "PhD Qualifying Examination by Sze Kee TAM on 8 July in room 4577 at 09:00. Title: Synthesis, processing and application of metal-based printed electronics nanomaterial"
	},
    
    {
	 "date": "30-Jun-14",
	 "category": "Spotlights",
	 "name": "Functional Composite Materials: Preparation, Characterization and Application",
	 "lenArticle": "PhD Qualifying Examination by Mingchang HU on 30 June 2014 in Room 4577 (lifts 27-28) at 15:00. Title: Functional Composite Materials: Preparation, Characterization and Application"
	},
    
    {
	 "date": "30-Jun-14",
	 "category": "Spotlights",
	 "name": "Process Development in Synthesis and Recycle of Lithium Ion Battery Cathode Material",
	 "lenArticle": "PhD Qualifying Examination by Guoqiang CAI on 30 June 2014 in Room 5560 (lifts 27-28) at 10:00. Title: Process Development in Synthesis and Recycle of Lithium Ion Battery Cathode Material"
	},
    
    {
	 "date": "24-Jun-14",
	 "category": "Spotlights",
	 "name": "Quality Assurance of Chinese Herbal Medicine: Fundamental Understanding of the Traditional Manufacturing Process",
	 "lenArticle": "PhD Qualifying Examination by Qi CHEN on 24 June 2014 at 17:15 in Room 4577. Title: Quality Assurance of Chinese Herbal Medicine: Fundamental Understanding of the Traditional Manufacturing Process"
	},
    
    {
	 "date": "05-Jun-14",
	 "category": "Spotlights",
	 "name": "Studies on Separation Process Intensification for Low Carbon Development",
	 "lenArticle": "Seminar by Weiyang FEI on 5 June 2014 in Room 4577 (lifts 27-28) at 14:30. Title: Studies on Separation Process Intensification for Low Carbon Development"
	},
    
    {
	 "date": "19-May-14",
	 "category": "Spotlights",
	 "name": "Transparent Conductive Oxide Nanocrystals: New Route Synthesis, Characterization and Application",
	 "lenArticle": "PhD Qualifying Examination by Shaojuan LUO on 19 May in Room 4577 (lifts 27-28) at 15:00. Title: Transparent Conductive Oxide Nanocrystals: New Route Synthesis, Characterization and Application"
	},
    
    {
	 "date": "14-May-14",
	 "category": "Spotlights",
	 "name": "How do polymer chains with different topologies crawl through a cylindrical pore under an elongation flow?",
	 "lenArticle": "Seminar by Prof Chi WU on 14 May 2014 in Chen Kuan Cheng Forum (LTH) at 14:30. Title: How do polymer chains with different topologies crawl through a cylindrical pore under an elongation flow?"
	},
    
    {
	 "date": "14-May-14",
	 "category": "Spotlights",
	 "name": "Study of Direct Carbon Fuel Cell at Intermediate Temperature Region",
	 "lenArticle": "PhD Thesis Presentation by Wenbin HAO on 14 May 2014 in Room 4577 (lifts 27-28) at 10:00. Title: Study of Direct Carbon Fuel Cell at Intermediate Temperature Region"
	},
    
    {
	 "date": "09-May-14",
	 "category": "Spotlights",
	 "name": "Advancing Regulatory Science in Engineering Education - Product Quality and Process Safety",
	 "lenArticle": "Joint Seminar by Division of Biomedical Engineering and Department of Chemical & Biomolecular Engineering on 9 May 2014 in Lecture Theatre K at 11:00. Speaker: Prof. Henry Y. Wang. Title: Advancing Regulatory Science in Engineering Education - Product Quality and Process Safety"
	},
    
    {
	 "date": "22-Apr-14",
	 "category": "Spotlights",
	 "name": "Role of aqueous-phase chemistry in secondary organic aerosol (SOA) formation",
	 "lenArticle": "PhD Qualifying Examination by Dandan HUANG on 22 April in Room 4577 (lifts 27-28) at 14:30. Title: Role of aqueous-phase chemistry in secondary organic aerosol (SOA) formation"
	},
    
    {
	 "date": "27-Mar-14",
	 "category": "Spotlights",
	 "name": "Experimental, Modelling and Optimisation of Pyrolysis of Solid Wastes",
	 "lenArticle": "PhD Thesis Presentation by Adetoyese Olajire OYEDUN on 27 March in Chow Tak Sin Lecture Theater (LTG)at 14:00. Title: Experimental, Modelling and Optimisation of Pyrolysis of Solid Wastes"
	},
    
    {
	 "date": "20-Mar-14",
	 "category": "Spotlights",
	 "name": "Estimators for Batch Processes: From Two-Time Dimensional to Three Dimensional",
	 "lenArticle": "PhD Qualifying Examination by Zhixing CAO on 20 March 2014 in Room 4577 (lifts 27-28) at 14:30. Title: Estimators for Batch Processes: From Two-Time Dimensional to Three Dimensional"
	},
    
    {
	 "date": "25-Feb-14",
	 "category": "Spotlights",
	 "name": "Dynamically Tunable Hydrogel Matrices: Cell Biology in the Fourth Dimension",
	 "lenArticle": "Joint seminar with Division of Biomedical Engineering by Prof. Kristi Anseth on 25 February 2014 in Room 5619 (lifts 31-32) at 14:30. Title: Dynamically Tunable Hydrogel Matrices: Cell Biology in the Fourth Dimension"
	},
    
    {
	 "date": "24-Feb-14",
	 "category": "Spotlights",
	 "name": "Evolution-traced multivariate statistical process control for batch processes",
	 "lenArticle": "PhD Qualify Examination by Luping ZHAO on 24 February at 14:00 in Room 4577 (lifts 27-28). Title: Evolution-traced multivariate statistical process control for batch processes"
	},
    
    {
	 "date": "10-Feb-14",
	 "category": "Spotlights",
	 "name": "Spatial Doping of 1D Titanium Nanotubes",
	 "lenArticle": "PhD Thesis Examination by Shammi Akter FERDOUSI on 10 February 2014 in Room 4577 (lifts 27-28) at 15:00. Title: Spatial Doping of 1D Titanium Nanotubes"
	},
    
    {
	 "date": "20-Jan-14",
	 "category": "Spotlights",
	 "name": "Real-Time Quantitative Detection Platform for Genetic Diseases Diagnosis",
	 "lenArticle": "PhD Qualifying Examination by Yinghua ZHANG on 20 January 2014 in Chen Kuan Cheng Forum (LT - H) at 14:00. Title: Real-Time Quantitative Detection Platform for Genetic Diseases Diagnosis"
	},
    
    {
	 "date": "17-Jan-14",
	 "category": "Spotlights",
	 "name": "Development and field testing of Smart Antimicrobial Coating",
	 "lenArticle": "PhD Qualifying Examination by Hong Hang LEUNG on 17 January 2014 in Room 4577 (lift 27) at 15:30. Title: Development and field testing of Smart Antimicrobial Coating"
	},
    
    {
	 "date": "16-Jan-14",
	 "category": "Spotlights",
	 "name": "Membranes for Fuel cells and Artificial Photosynthesis",
	 "lenArticle": "PhD Qualifying Examination by Viola SIM on 16 January 2014 in Room 4577 (lift 27) at 15:00. Title: Membranes for Fuel cells and Artificial Photosynthesis"
	},
    
    {
	 "date": "09-Jan-14",
	 "category": "Spotlights",
	 "name": "Chemical and Biological Microsystems - Advantages of Going Small",
	 "lenArticle": "Distinguished Lecture by Prof. Klavs F Jensen on 9 January 2014 in Lecture Theatre K at 16:00. Title: Chemical and Biological Microsystems - Advantages of Going Small"
	},
    
    {
	 "date": "19-Dec-13",
	 "category": "Spotlights",
	 "name": "Design and Application of DNA Self-Assembled Nanoarchitectures and Self-Replication of DNA origami",
	 "lenArticle": "PhD Thesis Presentation by He Xiaojin on 19 December 2013 in Room 4577 (lifts 27-28) at 10:00. Title: Design and Application of DNA Self-Assembled Nanoarchitectures and Self-Replication of DNA origami"
	},
    
    {
	 "date": "17-Dec-13",
	 "category": "Spotlights",
	 "name": "Building and Searching Predicted Spectral Libraries for Identification of Protein Post-translational Modifications",
	 "lenArticle": "PhD Qualifying Examination by Yingwei HU on 17 December 2013 in Room 5562 (lifts 27-28) at 10:00. Title: Building and Searching Predicted Spectral Libraries for Identification of Protein Post-translational Modifications"
	},
    
    {
	 "date": "11-Dec-13",
	 "category": "Spotlights",
	 "name": "Smart Implants Equipped with Active Nanoresevoirs for Regenerative Medicine",
	 "lenArticle": "Joint Seminar by Department of Chemical and Biomolecular Engineering and Division of Biomedical Engineering on 11 December 2013 in Chen Kuan Cheng Forum (LT-H). Title: Smart Implants Equipped with Active Nanoresevoirs for Regenerative Medicine"
	},
    
    {
	 "date": "11-Dec-13",
	 "category": "Spotlights",
	 "name": "Mechanism of ocular barriers modulation by low-intensity low frequency ultrasound on sclera and retinal pigment epithelium",
	 "lenArticle": "PhD Qualifying Examination by Langston Wai Leung SUEN on 11 December 2013 in Room 1511 (lifts 27-28) at 10:30. Title: Mechanism of ocular barriers modulation by low-intensity low frequency ultrasound on sclera and retinal pigment epithelium"
	},
    
    {
	 "date": "21-Nov-13",
	 "category": "Spotlights",
	 "name": "A Novel Catalytic System for the Removal of NOx from Lean-Burn Gasoline Engines",
	 "lenArticle": "PhD Qualifying Examination by Sabbaghi, Aghil on 21 November 2013 in Room 4577 at 14:30. Title: A Novel Catalytic System for the Removal of NOx from Lean-Burn Gasoline Engines"
	},
    
    {
	 "date": "15-Nov-13",
	 "category": "Spotlights",
	 "name": "Bioproducts Engineering from Waste: Learning Lessons from Nature",
	 "lenArticle": "Seminar by Prof. Rafael LUQUE on 15 November 2013 in Room 4502 at 14:30. Title: Bioproducts Engineering from Waste: Learning Lessons from Nature"
	},
    
    {
	 "date": "14-Nov-13",
	 "category": "Spotlights",
	 "name": "Using Modern Chromatography Column Technology to Promote the Applications of HPLC",
	 "lenArticle": "Seminar by Stanley, Juheon Kim on 14 November 2013 in Room 3584 at 09:30. Title: Using Modern Chromatography Column Technology to Promote the Applications of HPLC"
	},
    
    {
	 "date": "11-Nov-13",
	 "category": "Spotlights",
	 "name": "Synthesis & application of porous UHMWPE films",
	 "lenArticle": "PhD Qualifying Examination by Junaid SALEEM on 11 November 2013 in Room 3408 at 12:00. Title: Synthesis & application of porous UHMWPE films"
	},
    
    {
	 "date": "30-Oct-13",
	 "category": "Spotlights",
	 "name": "Emerging green technologies and alternative energy sources in Organic Chemistry",
	 "lenArticle": "Seminar by Prof Christophe LEN on 30 October 2013 in Rm 4577 (lifts 27-28) at 16:00. Title: Emerging green technologies and alternative energy sources in Organic Chemistry"
	},
    
    {
	 "date": "24-Oct-13",
	 "category": "Spotlights",
	 "name": "The Colloidal Silicon Nanomaterials",
	 "lenArticle": "Seminar by Colin Hessel on 24 October at 10:30 in Room 4577 (lifts 27-28). Title: The Colloidal Silicon Nanomaterials"
	},
    
    {
	 "date": "07-Oct-13",
	 "category": "Spotlights",
	 "name": "Synthesis of conductive carbon nanotubes - epoxy composite",
	 "lenArticle": "PhD Qualifying Examination by Kwan Hung CHAN on 7 October 2013 at 15:30 in Room 4577 (lifts 27-28). Title: Synthesis of conductive carbon nanotubes - epoxy composite"
	},
    
    {
	 "date": "04-Oct-13",
	 "category": "Spotlights",
	 "name": "Molecular Kinetics of Making and Burning Bio-oils",
	 "lenArticle": "Seminar by Phillip R. Westmoreland on 4 October 2013 in Engineering Common Area in Room 2580 (Lifts27-28) at 16:30. Title: Molecular Kinetics of Making and Burning Bio-oils"
	},
    
    {
	 "date": "04-Oct-13",
	 "category": "Spotlights",
	 "name": "Molecular Kinetics of Making and Burning Bio-oils",
	 "lenArticle": "Seminar by Phillip R. Westmoreland on 4 October 2013 in Engineering Common Area in Room 2580 (Lifts27-28) at 16:30. Title: Molecular Kinetics of Making and Burning Bio-oils"
	},
    
    {
	 "date": "11-Sep-13",
	 "category": "Spotlights",
	 "name": "ToF-SIMS Studies on Enhanced Mobility and Fragmentation Mechanism at Free Surface of Supported Polymer Films",
	 "lenArticle": "MPhil Thesis Presentation by Fu Yi on 11 September 2013 at 14:00 in Room 4577 (lifts 27-28). Title: ToF-SIMS Studies on Enhanced Mobility and Fragmentation Mechanism at Free Surface of Supported Polymer Films"
	},
    
    {
	 "date": "10-Sep-13",
	 "category": "Spotlights",
	 "name": "Measurement and control of aerosol nanoparticles -From nanomaterial to environments",
	 "lenArticle": "Seminar by Takafumi SETO on 10 September 2013 at 11:00 in Room 2612A (lifts 31-32). Title: Measurement and control of aerosol nanoparticles -From nanomaterial to environments"
	},
    
    {
	 "date": "10-Sep-13",
	 "category": "Spotlights",
	 "name": "Hygroscopicity Measurements of Atmospheric Aerosol using a Humidified Tandem Differential Mobility Analyzer (HTDMA) at a Suburban Site in Hong Kong",
	 "lenArticle": "PhD Thesis Presentation by Ming Chee Yeung on 10 September 2013 at 15:00 in Room 4577 (lifts 27-28). Title: Hygroscopicity Measurements of Atmospheric Aerosol using a Humidified Tandem Differential Mobility Analyzer (HTDMA) at a Suburban Site in Hong Kong"
	},
    
    {
	 "date": "10-Sep-13",
	 "category": "Spotlights",
	 "name": "Hygroscopicity Measurements of Atmospheric Aerosol using a Humidified Tandem Differential Mobility Analyzer (HTDMA) at a Suburban Site in Hong Kong",
	 "lenArticle": "PhD Thesis Presentation by Ming Chee Yeung on 10 September 2013 at 15:00 in Room 4577 (lifts 27-28). Title: Hygroscopicity Measurements of Atmospheric Aerosol using a Humidified Tandem Differential Mobility Analyzer (HTDMA) at a Suburban Site in Hong Kong"
	},
    
    {
	 "date": "06-Sep-13",
	 "category": "Spotlights",
	 "name": "Characterizing an ambient soft ionization source for studying the heterogeneous oxidation of oxygenated organic aerosols. The speaker: Dr. Man Nin Chan",
	 "lenArticle": "Joint Seminar by Department of Chemical and Biomolecular Engineering And Division of Environment on 6 September 2013 at 16:00 in Room 3584 (lifts 27-28). Title: Characterizing an ambient soft ionization source for studying the heterogeneous oxidation of oxygenated organic aerosols. The speaker: Dr. Man Nin Chan"
	},
    
    {
	 "date": "05-Sep-13",
	 "category": "Spotlights",
	 "name": "Controlled Release of Small Protein Tehrapeutic from In situ Hydrogel",
	 "lenArticle": "MPhil Thesis Examination by Li Aiwei on 5 September 2013 at 14:30 in Room 4577 (lifts 27-28). Title: Controlled Release of Small Protein Tehrapeutic from In situ Hydrogel"
	},
    
    {
	 "date": "04-Sep-13",
	 "category": "Spotlights",
	 "name": "FROM WASTE TO WEALTH USING GREEN CHEMISTRY",
	 "lenArticle": "Seminar by James Clark on 4 September 2013 at 14:30 in Room 4577 (lifts 27-28). Title: FROM WASTE TO WEALTH USING GREEN CHEMISTRY"
	},
    
    {
	 "date": "03-Sep-13",
	 "category": "Spotlights",
	 "name": "Zeolite Microneedles: Fabrication, Mechanics and Transdermal Drug Delivery",
	 "lenArticle": "MPhil Thesis Presentation by Poon Ho Yee Timothy on 3 September 2013 at 10:00 in Room 4577 (lifts 27-28). Title: Zeolite Microneedles: Fabrication, Mechanics and Transdermal Drug Delivery"
	},
    
    {
	 "date": "28-Aug-13",
	 "category": "Spotlights",
	 "name": "Methylative Homologation to Triptane by Acid Catalysis",
	 "lenArticle": "Seminar by Dr. Alex YIP on 28 August 2013 at 10:00 in Room 4577 (lifts 27-28). Title: Methylative Homologation to Triptane by Acid Catalysis"
	},
    
    {
	 "date": "27-Aug-13",
	 "category": "Spotlights",
	 "name": "Recovery of Sorption Products from Processing Non-Metallic E-Waste",
	 "lenArticle": "PhD Thesis Examination by Pejman Hadi on 27 August 2013 at 10:00 in Mr and Mrs Lee Siu Lun Lecture Theater (LTK). Title: Recovery of Sorption Products from Processing Non-Metallic E-Waste"
	},
    
    {
	 "date": "27-Aug-13",
	 "category": "Spotlights",
	 "name": "Controlled Release of Inorganic Gel for Air and Surface Disinfection",
	 "lenArticle": "MPhil Thesis Presentation by Doo Won HAN on 27 August 2013 at 14:00 in Room 4577 (lifts 27-28). Title: Controlled Release of Inorganic Gel for Air and Surface Disinfection"
	},
    
    {
	 "date": "23-Aug-13",
	 "category": "Spotlights",
	 "name": "Application of 1H-NMR metabolic profiling to the quality control of Traditional Chinese Medicine herbs and herbal decoctions",
	 "lenArticle": "PhD Thesis Presentation by Pui Hei CHAN on 23 August 2013 at 14:30 in Rm 5583 (lifts 27-28). Title: Application of 1H-NMR metabolic profiling to the quality control of Traditional Chinese Medicine herbs and herbal decoctions"
	},
    
    {
	 "date": "19-Aug-13",
	 "category": "Spotlights",
	 "name": "Optimization of MS/MS Spectral Library Searching for Higher-energy Collisional Dissociation (HCD) Spectra of Peptides",
	 "lenArticle": "MPhil Thesis Exam by ZHU Kan on 19 August 2013 at 14:00 in Rm 4577 (lifts 27-28). Title: Optimization of MS/MS Spectral Library Searching for Higher-energy Collisional Dissociation (HCD) Spectra of Peptides"
	},
    
    {
	 "date": "13-Aug-13",
	 "category": "Spotlights",
	 "name": "How to Survive Writing Your Thesis in English",
	 "lenArticle": "Seminar by Professor Catherine Nock on 13 August 2013 at 11:00 am in Chen Kuan Cheng Forum (LT - H). Title: How to Survive Writing Your Thesis in English"
	},
    
    {
	 "date": "31-Jul-13",
	 "category": "Spotlights",
	 "name": "Study of Direct Carbon Fuel Cell at Intermediate Temperature Region",
	 "lenArticle": "PhD Qualifying Examination by Wenbin HAO on 31 July 2013 at 10:00 am in Room 4577 (lifts 27-28). Title: Study of Direct Carbon Fuel Cell at Intermediate Temperature Region"
	},
    
    {
	 "date": "05-Jul-13",
	 "category": "Spotlights",
	 "name": "Tuning Native Metabolic Pathways for the Efficient Production of Chemicals.",
	 "lenArticle": "Joint Seminar by Department of Chemical and Biomolecular Engineering Bioengineering Program & Rensselaer Polytechnic Institute on 5 July at 10:30 by Prof. Mattheos Koffas. Title: Tuning Native Metabolic Pathways for the Efficient Production of Chemicals."
	},
    
    {
	 "date": "05-Jul-13",
	 "category": "Spotlights",
	 "name": "Malodor Treatment using Aerogel Nanocatalyst",
	 "lenArticle": "PhD Qualifying Examination by Hao CHEN on 5 July at 10:00 in Rm 1511 (lifts 27-28). Title: Malodor Treatment using Aerogel Nanocatalyst"
	},
    
    {
	 "date": "27-May-13",
	 "category": "Spotlights",
	 "name": "Physical and chemical uptakes of organic vapors by aerosol particles",
	 "lenArticle": "PhD Thesis Presentation by Lap Pong CHAN on 27 May 2013 at 15:00 in Room 4577 (lifts 27-28). Title: Physical and chemical uptakes of organic vapors by aerosol particles"
	},
    
    {
	 "date": "08-May-13",
	 "category": "Spotlights",
	 "name": "Antibiotic discovery and production: Basic, applied and development research",
	 "lenArticle": "Seminar by Prof. Daijie Chen on 8 March 2013 in Chen Kuan Cheng Forum (LTH) at 16:00. Title: Antibiotic discovery and production: Basic, applied and development research"
	},
    
    {
	 "date": "01-May-13",
	 "category": "Spotlights",
	 "name": "Protein Analogous Micelles: Versatile, Modular Nanoparticles",
	 "lenArticle": "IAS/SENG Joint Lecture by Professor Matthew Tirrell in celebration of the Twentieth Anniversary of the Department of Chemical and Biomolecular Engineering at 4:00pm on 1 March 2013 (Friday) in LT-H. Title: Protein Analogous Micelles: Versatile, Modular Nanoparticles"
	},
    
    {
	 "date": "31-Jan-13",
	 "category": "Spotlights",
	 "name": "Flow Synthesis of Material in Artificial Photosynthesis",
	 "lenArticle": "PhD Qualifying Examination by Tsz Nok NG on 31 January 2013 at 10:00 in Room 4577 (lifts 27-28). Title: Flow Synthesis of Material in Artificial Photosynthesis"
	},
    
    {
	 "date": "30-Jan-13",
	 "category": "Spotlights",
	 "name": "Guanidinium-modified polymeric carriers for intracellular drug delivery",
	 "lenArticle": "PhD Qualifying Examination by Junli ZHOU on 30 January 2013 at 10:00 in Room 4577 (lifts 27-28). Title: Guanidinium-modified polymeric carriers for intracellular drug delivery"
	},
    
    {
	 "date": "24-Jan-13",
	 "category": "Spotlights",
	 "name": "Modification on the Li-excess Material Li<sub>1.2</sub>Mn<sub>0.54</sub>Ni<sub>0.13</sub>Co<sub>0.13</sub>O<sub>2</sub> for Lithium Ion Batteries",
	 "lenArticle": "PhD Qualifying Examination by Hongjie XU on 24 January 2013 at 10:00 in Room 4577 (lifts 27-28). Title: Modification on the Li-excess Material Li<sub>1.2</sub>Mn<sub>0.54</sub>Ni<sub>0.13</sub>Co<sub>0.13</sub>O<sub>2</sub> for Lithium Ion Batteries"
	},
    
    {
	 "date": "24-Jan-13",
	 "category": "Spotlights",
	 "name": "Modification on the Li-excess Material Li<sub>1.2</sub>Mn<sub>0.54</sub>Ni<sub>0.13</sub>Co<sub>0.13</sub>O<sub>2</sub> for Lithium Ion Batteries",
	 "lenArticle": "PhD Qualifying Examination by Hongjie XU on 24 January 2013 at 10:00 in Room 4577 (lifts 27-28). Title: Modification on the Li-excess Material Li<sub>1.2</sub>Mn<sub>0.54</sub>Ni<sub>0.13</sub>Co<sub>0.13</sub>O<sub>2</sub> for Lithium Ion Batteries"
	},
    
    {
	 "date": "09-Jan-13",
	 "category": "Spotlights",
	 "name": "Formation and Regulation of Lipid Microdomains in Cell Membrane",
	 "lenArticle": "Seminar by Prof Jun FAN on 9 January 2013 in Room 4577 (lifts 27-28) at 11:00. Title: Formation and Regulation of Lipid Microdomains in Cell Membrane"
	},
    
    {
	 "date": "09-Jan-13",
	 "category": "Spotlights",
	 "name": "From one-time dimensional control to two-time dimensional hybrid control in batch processes",
	 "lenArticle": "PhD Thesis Presentation by Shengyong MO on 9 January 2013 in Rm 4577 (lifts 27-28) at 15:00. Title: From one-time dimensional control to two-time dimensional hybrid control in batch processes"
	},
    
    {
	 "date": "11-Dec-12",
	 "category": "Spotlights",
	 "name": "Interfacial Effects of Molecular Devices: from Concept to Functions",
	 "lenArticle": "Seminar by Xuefeng GUO on 11 December 2012 in Room 4483 (lifts 25-26). Title: Interfacial Effects of Molecular Devices: from Concept to Functions"
	},
    
    {
	 "date": "04-Dec-12",
	 "category": "Spotlights",
	 "name": "Catalytic Conversion of Biomass to Chemicals.",
	 "lenArticle": "Joint seminar with Chemistry Dept on 4 December 2012 at 10:30 in Lecture Theatre H. Speaker: Prof. Tao ZHANG. Title: Catalytic Conversion of Biomass to Chemicals."
	},
    
    {
	 "date": "27-Nov-12",
	 "category": "Spotlights",
	 "name": "Membrane Modification by Magneli Titanium Sub-oxides for Wastewater Treatment",
	 "lenArticle": "PhD Qualifying Examination by GENG Ping on 27 Nov 2012 at 15:00 in Rm 4577 (lifts 27-28). Title: Membrane Modification by Magneli Titanium Sub-oxides for Wastewater Treatment"
	},
    
    {
	 "date": "31-Aug-12",
	 "category": "Spotlights",
	 "name": "A Method for Production of Chinese Herbal Medicines with Quality Assurance.",
	 "lenArticle": "PhD Thesis Examination by LAU Yeuk Tin on 31 August 2012 in Room 4577 (lifts 27-28) at 15:30. Title: A Method for Production of Chinese Herbal Medicines with Quality Assurance."
	},
 
    {
	 "date": "24-Aug-12",
	 "category": "Spotlights",
	 "name": "Recovery of Sorption Products from Processing Non-Metallic E-Waste",
	 "lenArticle": "PhD Qualifying Examination by Pejman Hadi on 24 August 2012 in Room 5564 (lifts 27-28) at 10:00. Title: Recovery of Sorption Products from Processing Non-Metallic E-Waste"
	},
    
    {
	 "date": "22-Aug-12",
	 "category": "Spotlights",
	 "name": "Synthesis and Characterization of Ionic Liquid Polymer Gel for Advanced Lithium Ion Battery",
	 "lenArticle": "MPhil Thesis Presentation by CHOI Kwan Kin on 22 August 2012 in Room 4577 (lifts 27-28) at 10:00. Title: Synthesis and Characterization of Ionic Liquid Polymer Gel for Advanced Lithium Ion Battery"
	},
    
    {
	 "date": "20-Aug-12",
	 "category": "Spotlights",
	 "name": "A Comparative Study on Selective Adsorption of Heavy Metal Ions",
	 "lenArticle": "MPhil Thesis Presentation by KOONG Len Foong on 20 August 2012 in Room 4577 (lifts 27-28) at 15:00. Title: A Comparative Study on Selective Adsorption of Heavy Metal Ions"
	},
    
    {
	 "date": "15-Aug-12",
	 "category": "Spotlights",
	 "name": "A Novel Approach for Synthesis of Polypyrrole Nanoparticles and Its Application in Photo Sensing and Gas Sensing",
	 "lenArticle": "MPhil Thesis Presentation by TAN, Zhihua on 15 August 2012 in Room 4577 (lifts 27-28) at 10:00. Title: A Novel Approach for Synthesis of Polypyrrole Nanoparticles and Its Application in Photo Sensing and Gas Sensing"
	},
    
    {
	 "date": "14-Aug-12",
	 "category": "Spotlights",
	 "name": "Modelling and Experimental Studies of Biomass and Organic Pyrolysis",
	 "lenArticle": "MPhil Thesis Presentation by LAM, Ka Leung on 14 August 2012 in Room 4577 (lifts 27-28) at 14:30. Title: Modelling and Experimental Studies of Biomass and Organic Pyrolysis"
	},
 
    {
	 "date": "25-Jul-12",
	 "category": "Spotlights",
	 "name": "Synthesis and Application of An Antimicrobial Coating Based on Polymer Encapsulate C1O2",
	 "lenArticle": "PhD Qualifying Examination by CHANG Qing on 9 August 2012 in Room 4577 (lifts 27-28) at 14:30. Title: Synthesis and Application of An Antimicrobial Coating Based on Polymer Encapsulate C1O2"
	},

    {
	 "date": "25-Jul-12",
	 "category": "Spotlights",
	 "name": "Effect of Chain Extenders on the Microrheology of Polyester",
	 "lenArticle": "MPhil Thesis Presentation by WANG Shihua on 25 July 2012 in Room 4577 (lifts 27-28) at 09:00. Title: Effect of Chain Extenders on the Microrheology of Polyester"
	},
    
    {
	 "date": "05-Jul-12",
	 "category": "Spotlights",
	 "name": "The Morphology and Instability of Polymer Thin Films",
	 "lenArticle": "PhD Thesis Presentation by Ren Xianwen on 5 July at 17:00 in Rm 4577 (lifts 27-28). Title: The Morphology and Instability of Polymer Thin Films"
	},
    
    {
	 "date": "29-Mar-12",
	 "category": "Spotlights",
	 "name": "Modelling and Optimization of Pyrolysis of Solid Wastes",
	 "lenArticle": "PhD Qualifying Examination by OYEDUN, Adetoyese Olajire on 29 May 2012 in Room 4577 at 14:00. Title: Modelling and Optimization of Pyrolysis of Solid Wastes"
	},

    {
	 "date": "28-Mar-12",
	 "category": "Spotlights",
	 "name": "Modular Approach for the Construction of Soft and Hybrid Biomaterials",
	 "lenArticle": "Seminar by Xinqiao JIA on 28 May 2012 at 14:30 in Room 4577 (lifts 27-28). Title: Modular Approach for the Construction of Soft and Hybrid Biomaterials"
	},
    
    {
	 "date": "18-Mar-12",
	 "category": "Spotlights",
	 "name": "Targeted delivery to retinal pigment epithelium by folate-decorated nanoparticles",
	 "lenArticle": "Mphil Thesis Presentation by SUEN, Wai Leung Langston on 18 May 2012 in Room 4577 (lifts 27-28) at 10:00am. Title: Targeted delivery to retinal pigment epithelium by folate-decorated nanoparticles"
	},
    
    {
	 "date": "29-Mar-12",
	 "category": "Spotlights",
	 "name": "Quality Assurance of Chinese Herbal Medicines",
	 "lenArticle": "PhD Qualifying Examination by LAU Yeuk Tin on 29 March 2012 at 14:00 in Room 4577 (lifts 27-28). Title: Quality Assurance of Chinese Herbal Medicines"
	},
    
    {
	 "date": "17-Feb-12",
	 "category": "Spotlights",
	 "name": "Current challenges in preprocessing of label-free LC-MS data of complex proteomics samples",
	 "lenArticle": "Seminar by Prof. P. Horvatovich on 17 February 2012 at 16:30 in Chen Kuan Cheng Lecture Forum (LTH). Title: Current challenges in preprocessing of label-free LC-MS data of complex proteomics samples"
	},
    
    {
	 "date": "16-Feb-12",
	 "category": "Spotlights",
	 "name": "Production of High-Value Added Products Using Supercritical Fluid Technologies",
	 "lenArticle": "PhD Thesis Examination by Lin Sze Man on 16 February at 14:30 in Room 4577 (lifts 27-28). Title: Production of High-Value Added Products Using Supercritical Fluid Technologies"
	},

    {
	 "date": "14-Feb-12",
	 "category": "Spotlights",
	 "name": "From Waste to Wealth using Green Chemistry",
	 "lenArticle": "Seminar by James Clark on 14 Feb 2012 in Room 4475 (lifts 25-26) at 16:00. Title: From Waste to Wealth using Green Chemistry"
	},
    
    {
	 "date": "13-Feb-12",
	 "category": "Spotlights",
	 "name": "Recycling Plastics and Rubber tyres as a Resource for EAF steelmaking",
	 "lenArticle": "Seminar by Veena Sahajwalla on 13 Feb 2012 in Rm 7341 at 10:30. Title: Recycling Plastics and Rubber tyres as a Resource for EAF steelmaking"
	},
 
    {
	 "date": "16-Jan-12",
	 "category": "Spotlights",
	 "name": "Synthesis, Structure, and Properties of TLCP/MWNT Composites",
	 "lenArticle": "PhD Thesis Presentation by REN, Changyou on 16 January 2012 in Room 4577 (lifts 27-28) at 10:00. Title: Synthesis, Structure, and Properties of TLCP/MWNT Composites"
	},
    
    {
	 "date": "10-Jan-12",
	 "category": "Spotlights",
	 "name": "Ultrasensitive immobilization-free electrochemical DNA biosensors based on enzyme assisted signal generation and amplification",
	 "lenArticle": "PhD Qualifying Examination by XUAN, Feng on 10 January 2012 at 15:00 in Room 4577 (lifts 27-28). Title: Ultrasensitive immobilization-free electrochemical DNA biosensors based on enzyme assisted signal generation and amplification"
	},
    
    {
	 "date": "28-Dec-11",
	 "category": "Spotlights",
	 "name": "",
	 "lenArticle": "Advanced Electrochemical Energy Symposium 28-31 December 2011"
	},

    {
	 "date": "20-Dec-11",
	 "category": "Spotlights",
	 "name": "Composition and Aging of Organic Aerosols Inferred From Laboratory and Ambient Aerosol Mass Spectrometry Measurements",
	 "lenArticle": "Joint Seminar by Department of Chemical and Biomolecular Engineering & Division of Environment on 20 December 2011 in Rm 4504 (lifts 25-26) at 11:00 am. Speaker: Prof. Nga Lee (Sally) Ng. Title: Composition and Aging of Organic Aerosols Inferred From Laboratory and Ambient Aerosol Mass Spectrometry Measurements"
	},
    
    {
	 "date": "09-Dec-11",
	 "category": "Spotlights",
	 "name": "Ultrasound-mediated Transscleral Drug Delivery",
	 "lenArticle": "MPhil Thesis Examination by WONG, Hoi Sang on 9 December at 10:00 in Room 4577 (lifts 27-28). Title: Ultrasound-mediated Transscleral Drug Delivery"
	},
    
    {
	 "date": "14-Nov-11",
	 "category": "Spotlights",
	 "name": "Engineering of Extracellular Microenvironment to Modulate Neuronal Differentiation",
	 "lenArticle": "PhD Thesis Presentation by LI, Qianqian on 14 November 2011 in Room 2404 (lifts 17-18) at 15:30. Title: Engineering of Extracellular Microenvironment to Modulate Neuronal Differentiation"
	},
    
    {
	 "date": "14-Nov-11",
	 "category": "Spotlights",
	 "name": "DEVELOPMENT OF POROUS SPACE MAINTAINERS FOR CRANIOFACIAL TISSUE ENGINEERING",
	 "lenArticle": "Seminar by Antonios G. Mikos on 14 November 2011 in Cheung On Tak Lecture Theater (LTE) at 10:30 am. Title: DEVELOPMENT OF POROUS SPACE MAINTAINERS FOR CRANIOFACIAL TISSUE ENGINEERING"
	},
    
    {
	 "date": "04-Nov-11",
	 "category": "Spotlights",
	 "name": "Engineered structures for catalysis and electrical energy storage",
	 "lenArticle": "Seminar by Prof. Harold Kung on 4 November 2011 in Chen Kuan Cheng Lecture Theatre (LTH) at 16:00. Title: Engineered structures for catalysis and electrical energy storage"
	},
    
    {
	 "date": "13-Oct-11",
	 "category": "Spotlights",
	 "name": "Economic Model Predictive Control for Building Energy Systems",
	 "lenArticle": "Seminar by Prof. Joe Qin on 13 October 2011 in Room 4577 (lifts 27-28) at 11:00. Title: Economic Model Predictive Control for Building Energy Systems"
	},
    
    {
	 "date": "11-Oct-11",
	 "category": "Spotlights",
	 "name": "Engineering Energy Conversion in Porous Electrodes",
	 "lenArticle": "Seminar by Professor Kwong-Yu CHAN on 11 October 2011 in Lam Woo Lecture Theatre (LTB) at 14:00. Title: Engineering Energy Conversion in Porous Electrodes"
	},
 
    {
	 "date": "06-Oct-11",
	 "category": "Spotlights",
	 "name": "From Process Flowsheets to the Virtual Human Simulator",
	 "lenArticle": "Seminar by Professor Andreas A. Linninger on 6 October 2011 in Lecture Theatre D at 14:00. Title: From Process Flowsheets to the Virtual Human Simulator"
	},
    
    {
	 "date": "28-Sep-11",
	 "category": "Spotlights",
	 "name": "Dimensionally Stable Anodes (DSA): Preparation, characterization and applications",
	 "lenArticle": "Seminar by Professor Guohua CHEN on 28 September 2011 at 14:00 in the Padma & Hari Harilela Lecture Theatre (LTC). Title: Dimensionally Stable Anodes (DSA): Preparation, characterization and applications"
	},
    
    {
	 "date": "21-Sep-11",
	 "category": "Spotlights",
	 "name": "Adsorption of Endocrine Disrupting Compounds",
	 "lenArticle": "MPhil Thesis Presentaion by Mak, Shuk Fong on 21 September 2011 at 10:30 am in Room 4577 (lifts 27-28). Title: Adsorption of Endocrine Disrupting Compounds"
	},

    {
	 "date": "19-Sep-11",
	 "category": "Spotlights",
	 "name": "Zeolite Membrane Reactor for Treating Endorine Disrupting Compounds in Water",
	 "lenArticle": "MPhil Thesis Presentation by Chan, Wai Kit on 19 September 2011 at 10:00 am in Room 4577 (lifts 27-28). Title: Zeolite Membrane Reactor for Treating Endorine Disrupting Compounds in Water"
	},

    {
	 "date": "16-Sep-11",
	 "category": "Spotlights",
	 "name": "Experiment and Modeling of Advanced Ozone Membrane Reactor",
	 "lenArticle": "MPhil Thesis Presentation by HO, Hung Lai on 16 September 2011 at 10:00 am in Room 4577 (lifts 27-28). Title: Experiment and Modeling of Advanced Ozone Membrane Reactor"
	},
    
    {
	 "date": "16-Sep-11",
	 "category": "Spotlights",
	 "name": "Experiment and Modeling of Advanced Ozone Membrane Reactor",
	 "lenArticle": "MPhil Thesis Presentation by HO, Hung Lai on 16 September 2011 at 10:00 am in Room 4577 (lifts 27-28). Title: Experiment and Modeling of Advanced Ozone Membrane Reactor"
	},
    
    {
	 "date": "14-Sep-11",
	 "category": "Spotlights",
	 "name": "Adsorption - whatever colour the cat as long as it catches the mouse",
	 "lenArticle": "Seminar by Professor ALLEN Stephen John on 14 September 2011 at 14:00 in Padma & Hari Harilela Lecture Theatre (LTC). Titel: Adsorption - whatever colour the cat as long as it catches the mouse"
	},
    
    {
	 "date": "26-Aug-11",
	 "category": "Spotlights",
	 "name": "Cost-Based Process Control and Optimizaton of a Pilot Electrocoagulation- Electroflotation Process",
	 "lenArticle": "PhD Thesis Presentation by Qin, Xusong on 26 August 2011 at 14:30 in Room 4577 (lifts 27-28). Title: Cost-Based Process Control and Optimizaton of a Pilot Electrocoagulation- Electroflotation Process"
	},
 
    {
	 "date": "23-Aug-11",
	 "category": "Spotlights",
	 "name": " Heterogeneous Acid-Catalyzed Reactions of β-Caryophyllene",
	 "lenArticle": "MPhil Thesis Presentation by YUAN, Mingyue on 23 August 2011 at 15:00 in Room 4577 (lifts 27-28). Title: Heterogeneous Acid-Catalyzed Reactions of β-Caryophyllene"
	},

    {
	 "date": "23-Aug-11",
	 "category": "Spotlights",
	 "name": "Construction of nanoparticles by self-assembly of small aromatic molecules as drug carriers",
	 "lenArticle": "PhD Thesis Presentation by WANG, Weiping on 23 August 2011 at 15:00 in Mr and Mrs Lee Siu Lun Lecture Theater (LTK). Title: Construction of nanoparticles by self-assembly of small aromatic molecules as drug carriers"
	},
 
    {
	 "date": "23-Aug-11",
	 "category": "Spotlights",
	 "name": "Construction of nanoparticles by self-assembly of small aromatic molecules as drug carriers",
	 "lenArticle": "PhD Thesis Presentation by WANG, Weiping on 23 August 2011 at 15:00 in Mr and Mrs Lee Siu Lun Lecture Theater (LTK). Title: Construction of nanoparticles by self-assembly of small aromatic molecules as drug carriers"
	},
    
    {
	 "date": "23-Aug-11",
	 "category": "Spotlights",
	 "name": "Construction of nanoparticles by self-assembly of small aromatic molecules as drug carriers",
	 "lenArticle": "PhD Thesis Presentation by WANG, Weiping on 23 August 2011 at 15:00 in Mr and Mrs Lee Siu Lun Lecture Theater (LTK). Title: Construction of nanoparticles by self-assembly of small aromatic molecules as drug carriers"
	},
    
    {
	 "date": "22-Aug-11",
	 "category": "Spotlights",
	 "name": "Fabrication and characterizations of metallic nanostructured materials",
	 "lenArticle": "MPhil Thesis Presentation by WONG, Chi Cheong on 22 August 2011 at 14:30 in Room 4577 (lifts 27-28). Title: Fabrication and characterizations of metallic nanostructured materials"
	},
    
    {
	 "date": "22-Aug-11",
	 "category": "Spotlights",
	 "name": "Fabrication and characterizations of metallic nanostructured materials",
	 "lenArticle": "MPhil Thesis Presentation by WONG, Chi Cheong on 22 August 2011 at 14:30 in Room 4577 (lifts 27-28). Title: Fabrication and characterizations of metallic nanostructured materials"
	},
     
    {
	 "date": "19-Aug-11",
	 "category": "Spotlights",
	 "name": "Sporicidal Properties of Multilevel Antimicrobial Coating",
	 "lenArticle": "MPhil Thesis Presentation by LUI, Yat Chuen on 19 August 2011 at 14:00 in Room 4577 (lifts 27-28). Title: Sporicidal Properties of Multilevel Antimicrobial Coating"
	},

    {
	 "date": "17-Aug-11",
	 "category": "Spotlights",
	 "name": "The Field Testing of Smart Antimicrobial Coating",
	 "lenArticle": "MPhil Thesis Presentation by LEUNG, Hong Hang on 17 August 2011 at 10:00 am in Room 4577 (lifts 27-28). Title: The Field Testing of Smart Antimicrobial Coating"
	},
    
    {
	 "date": "16-Aug-11",
	 "category": "Spotlights",
	 "name": "Flow Synthesis of Nano-scale MCM-41",
	 "lenArticle": "Mphil Thesis Presentation by NG, Tsz Nok on 16 August 2011 at 15:00 in Room 4577 (lifts 27-28). Title: Flow Synthesis of Nano-scale MCM-41"
	},
    
    {
	 "date": "15-Aug-11",
	 "category": "Spotlights",
	 "name": "Synthesis and Application of Mesoporous Silica",
	 "lenArticle": "PhD Thesis Examination by CHEN, Xinqing on 15 August 2011 at 15:00 in Room 4577 (lifts 27-28). Title: Synthesis and Application of Mesoporous Silica"
	},

    {
	 "date": "12-Aug-11",
	 "category": "Spotlights",
	 "name": "Development of nanoscale catalysts for direct liquid-fed fuel cell applications",
	 "lenArticle": "PhD Thesis Examination by SUO, Yange on 12 August 2011 at 10:00 am in Room 4577 (lifts 27-28). Title: Development of nanoscale catalysts for direct liquid-fed fuel cell applications"
	},

    {
	 "date": "11-Aug-11",
	 "category": "Spotlights",
	 "name": "Synthesis and charactrization of photocatalysts for efficient treatment of endocrine disrupting compounds in water",
	 "lenArticle": "PhD Qualifying Examination by FERDOUSI, Shammi Akter on 11 August 2011 at 09:00 in Room 4577 (lifts 27-28). Title: Synthesis and charactrization of photocatalysts for efficient treatment of endocrine disrupting compounds in water"
	},
    
    {
	 "date": "04-Aug-11",
	 "category": "Spotlights",
	 "name": "A Semiempirical Approach to Predict Unobserved Peptide MS/MS Spectra from Spectral Libraries",
	 "lenArticle": "MPhil Thesis Presentation by HU, Yingwei on 4 August 2011 at 10:00 am in Rm 4577 (lifts 27-28). Title: A Semiempirical Approach to Predict Unobserved Peptide MS/MS Spectra from Spectral Libraries"
	},
 
    {
	 "date": "15-Jul-11",
	 "category": "Spotlights",
	 "name": "Preparation and Applications of Aggregation-Induced Emission Materials as Bioprobes",
	 "lenArticle": "PhD Thesis Examination by YU, Yong on 15 July 2011 at 15:00 in Rm 4577 (lifts 27-28). Title: Preparation and Applications of Aggregation-Induced Emission Materials as Bioprobes"
	},
 
    {
	 "date": "07-May-11",
	 "category": "Spotlights",
	 "name": "",
	 "lenArticle": "Mass Session on 7 May 2011 in Lecture Theatre B"
	},
    
    {
	 "date": "27-Apr-11",
	 "category": "Spotlights",
	 "name": "Understanding aerosol hygroscopic growth and cloud activation under sub or super saturated regimes: Size-resolved techniques for ambient measurements",
	 "lenArticle": "PhD Qualifying Examination by YEUNG, Ming Chee on 27 April 2011 at 11:30 am in Room 3501 (lifts 25-26). Title: Understanding aerosol hygroscopic growth and cloud activation under sub or super saturated regimes: Size-resolved techniques for ambient measurements"
	},

    {
	 "date": "08-Apr-11",
	 "category": "Spotlights",
	 "name": "Acid-Responsive Polymeric Nanomaterials for Nucleic Acid Delivery and Combined Imaging",
	 "lenArticle": "Seminar by Young Jik Kwon on 8 April 2011 in Room 5583 (lifts 29-30). Title: Acid-Responsive Polymeric Nanomaterials for Nucleic Acid Delivery and Combined Imaging"
	},
    
    {
	 "date": "11-Feb-11",
	 "category": "Spotlights",
	 "name": "Study of Traditional Chinese Medicine by Omics Technology: a system biology approach",
	 "lenArticle": "PhD Qualifying Examination by CHAN, Pui Hei on 11 February 2011 at 10:30 am in Room 4577 (lifts 27-28). Title: Study of Traditional Chinese Medicine by Omics Technology: a system biology approach"
	},
    
    {
	 "date": "28-Jan-11",
	 "category": "Spotlights",
	 "name": "Towards a Paradigm for Chemical Product Design and Development",
	 "lenArticle": "PhD Thesis Presentation by CHENG, Yuen Shan on 28 January 2011 at 09:30 am in Room 4577 (lifts 27-28). Title: Towards a Paradigm for Chemical Product Design and Development"
	},
    
    {
	 "date": "21-Jan-11",
	 "category": "Spotlights",
	 "name": "Separation and Purification by Crystallization – Thermodynamic and Kinetic Aspects",
	 "lenArticle": "PhD Thesis Presentation by KWOK, Kui Sing on 21 January 2011 at 15:00 in Room 4577 (lifts 27-28). Title: Separation and Purification by Crystallization – Thermodynamic and Kinetic Aspects"
	},

    {
	 "date": "20-Jan-11",
	 "category": "Spotlights",
	 "name": "Rheological and Microstructural Analysis of CNTs/Polymer composites",
	 "lenArticle": "MPhil Thesis Presentation by LEE, Lai Sheung on 20 January 2011 at 10:30 am in Room 4577 (lifts 27-28). Title: Rheological and Microstructural Analysis of CNTs/Polymer composites"
	},

    {
	 "date": "10-Jan-11",
	 "category": "Spotlights",
	 "name": "Design of Protein Crystallization Process Guided by Phase Diagram",
	 "lenArticle": "MPhil Thesis Presentation by TAM, Sze Kee on 10 January 2011 at 10:00 in Room 3598 (Lift 27-28). Title: Design of Protein Crystallization Process Guided by Phase Diagram"
	},
 
    {
	 "date": "10-Dec-10",
	 "category": "Spotlights",
	 "name": "Design of DNA self-Assembled Nanoarchitectures and Their Applications in Nanotechnology",
	 "lenArticle": "PhD Qualifying Examination by HE, Xiaojin on 10 December 2010 in Room 4577 at 10:00. Title: Design of DNA self-Assembled Nanoarchitectures and Their Applications in Nanotechnology"
	},

    {
	 "date": "10-Dec-10",
	 "category": "Spotlights",
	 "name": "Design of DNA self-Assembled Nanoarchitectures and Their Applications in Nanotechnology",
	 "lenArticle": "PhD Qualifying Examination by HE, Xiaojin on 10 December 2010 in Room 4577 at 10:00. Title: Design of DNA self-Assembled Nanoarchitectures and Their Applications in Nanotechnology"
	},
 
    {
	 "date": "12-Oct-10",
	 "category": "Spotlights",
	 "name": "",
	 "lenArticle": "JPG Workshop on Nano-Scale Catalyst for Energy and Environmental 11-12 October"
	},

    {
	 "date": "30-Sep-10",
	 "category": "Spotlights",
	 "name": "Overcoming Biomass Recalcitrance for Biofuel Production: Mechanisms of Cellulose Deconstruction and Cellulase Engineering",
	 "lenArticle": "Joint Seminar Deparment of Chemical and Biomolecular Engineering & Department of Chemistry by Dr. Jhih-Wei Chu on 30 Sep 2010 at 15:00 in Lee Wing Tat Lecture Theater (LTD). Title: Overcoming Biomass Recalcitrance for Biofuel Production: Mechanisms of Cellulose Deconstruction and Cellulase Engineering"
	},

    {
	 "date": "02-Sep-10",
	 "category": "Spotlights",
	 "name": "Lab-on-Chip and Chemical Processing - Bytes vs. Tons - a Contradiction or Visionary Concept",
	 "lenArticle": "Joint Seminar by William Mong Institute of Nano Science and Technology & Dept of CBME by Holger Loewe on 2 Sep 2010 in Room 3315 at 16:00. title: Lab-on-Chip and Chemical Processing - Bytes vs. Tons - a Contradiction or Visionary Concept"
	},

    {
	 "date": "01-Sep-10",
	 "category": "Spotlights",
	 "name": "A novel functionalized ordered mesoporous carbon as an efficient adsorbent for dye removal",
	 "lenArticle": "PhD Thesis Presentation by HE Chun on 1 September 2010 in Room 4577 (Lifts 27-28) at 15:00. Title: A novel functionalized ordered mesoporous carbon as an efficient adsorbent for dye removal"
	},
 
    {
	 "date": "06-Aug-10",
	 "category": "Spotlights",
	 "name": "Characterize and use of waste ash residues in the production of cement clinkers",
	 "lenArticle": "Mphil Thesis Presentation by LAM, Hoi King Charles on 6 August 2010 in Room 4577 (Lifts 27-28) at 10:00. Title: Characterize and use of waste ash residues in the production of cement clinkers"
	},

    {
	 "date": "05-Aug-10",
	 "category": "Spotlights",
	 "name": "Using Supercritical CO2-based Nanomization Technology to Improve the Water Solubility and Bioavailability of Soy Isoflavones",
	 "lenArticle": "Mphil Thesis Presentation by XU, Jinjie on 5 August 2010 in Room 4577 (Lifts 27-28) at 15:00. Title: Using Supercritical CO2-based Nanomization Technology to Improve the Water Solubility and Bioavailability of Soy Isoflavones"
	},

    {
	 "date": "04-Jun-10",
	 "category": "Spotlights",
	 "name": "Production and Characterisation of Tyre Derived Demineralised Activated Carbon and Its Dye and Phenol Adsorption Capacities",
	 "lenArticle": "Mphil Thesis Presentation by CHAN, Oi Sum on 4 June 2010 in Room 4577 (Lifts 27-28) at 10:00 am. Title: Production and Characterisation of Tyre Derived Demineralised Activated Carbon and Its Dye and Phenol Adsorption Capacities"
	},
 
    {
	 "date": "17-May-10",
	 "category": "Spotlights",
	 "name": "Pharmaceutical Engineering and Design for Global Health",
	 "lenArticle": "Joint Seminar by School of Engineering - Bioengineering Graduate Program (BIEN) and Department of Chemical Engineering on 17 May 2010 in Mr. and Mrs. Lee Siu Lun Lecture Theatre (K) at 11:00 am. Title: Pharmaceutical Engineering and Design for Global Health"
	},
    
    {
	 "date": "10-May-10",
	 "category": "Spotlights",
	 "name": "Two dimensional control of batch processes with hybrid nature",
	 "lenArticle": "PhD Qualifying Examination by MO, Shengyong on 10 May 2010 in Room 5564 (lifts 27-28) at 10:00 am. Title: Two dimensional control of batch processes with hybrid nature"
	},
    
    {
	 "date": "23-Apr-10",
	 "category": "Spotlights",
	 "name": "The Role of Chemical Engineering in the Search for Solar Neutrinos",
	 "lenArticle": "Seminar by Prof. Benziger on 23 April 2010 at 09:30 in Room 4502. Title: The Role of Chemical Engineering in the Search for Solar Neutrinos"
	},

    {
	 "date": "22-Apr-10",
	 "category": "Spotlights",
	 "name": "Fan the Flame with Water: Operation of PEM Fuel Cells with Dry Feeds",
	 "lenArticle": "Seminar by Prof. Benziger on 22 April 2010 at 15:00 in Lecture Theatre K. Title: Fan the Flame with Water: Operation of PEM Fuel Cells with Dry Feeds"
	},
    
    {
	 "date": "10-Mar-10",
	 "category": "Spotlights",
	 "name": "Efficient Product Design and Reliable Process Modelling with accurate thermophysical property data and models using the DETHERM Suite",
	 "lenArticle": "Seminar by Dr. Willi Meier and Dr. Richard Sass on 10 March 2010 at 14:30 in Room 4577 (lifts 27-28). Title: Efficient Product Design and Reliable Process Modelling with accurate thermophysical property data and models using the DETHERM Suite"
	},
    
    {
	 "date": "28-Jan-10",
	 "category": "Spotlights",
	 "name": "Study of Surfaces of Semi-Crystalline Polymers by Static Time-of-flight Secondary Ion Mass Spectrometry",
	 "lenArticle": "PhD Thesis Presentation by Richard Yiu Ting LAU on 28 January 2010 in Room 4505 (lifts 25-26) at 09:30 am. Title: Study of Surfaces of Semi-Crystalline Polymers by Static Time-of-flight Secondary Ion Mass Spectrometry"
	},
 
    {
	 "date": "27-Jan-10",
	 "category": "Spotlights",
	 "name": "Reduction of Methanol Crossover in Direct Methanol Fuel Cells by an Integrated Anode Structure and Composite Electrolyte Membrane",
	 "lenArticle": "PhD Thesis Presentation by Haifeng ZHANG on 27 January 2009 in Room 4577 at 10:00 am. Title: Reduction of Methanol Crossover in Direct Methanol Fuel Cells by an Integrated Anode Structure and Composite Electrolyte Membrane"
	},
 
    {
	 "date": "25-Jan-10",
	 "category": "Spotlights",
	 "name": "Magnetic Particle Based Sensing Platform for Oligonucleotide and PCR Amplicon Detection",
	 "lenArticle": "MPhIl Thesis Presentation by JingJing XU on 25 January 2010 in Room 4577 at 10:00 am. Title: Magnetic Particle Based Sensing Platform for Oligonucleotide and PCR Amplicon Detection MPhIl Thesis Presentation by JingJing XU on 25 January 2010 in Room 4577 at 10:00 am. Title: Magnetic Particle Based Sensing Platform for Oligonucleotide and PCR Amplicon Detection"
	},
 
    {
	 "date": "22-Jan-10",
	 "category": "Spotlights",
	 "name": "Symmetry break-up of polymer films under microwave",
	 "lenArticle": "MPhIl Thesis Presentation by Wai Chung WONG on 22 January 2010 in Room 4577 at 14:00. Title: Symmetry break-up of polymer films under microwave"
	},
 
    {
	 "date": "13-Jan-10",
	 "category": "Spotlights",
	 "name": "Effect of carbon nanotubes on the mechanical properties of fibers of main chain thermotropic liquid crystalline copolyesters",
	 "lenArticle": "PhD Qualifying Examination by Changyou REN on 13 January 2010 in Room 5563 at 10:00 am. Title: Effect of carbon nanotubes on the mechanical properties of fibers of main chain thermotropic liquid crystalline copolyesters"
	},
 
    {
	 "date": "10-Jan-10",
	 "category": "Spotlights",
	 "name": "Design of Protein Crystallization Process Guided by Phase Diagram",
	 "lenArticle": "MPhil Thesis Presentation by TAM, Sze Kee on 10 January 2010 at 10:00 am in Room 3598 (Lift 27-28). Title: Design of Protein Crystallization Process Guided by Phase Diagram"
	},

    {
	 "date": "07-Jan-10",
	 "category": "Spotlights",
	 "name": "Preparation of Aggregation-Induced Emission-Active Nanomaterials and Exploration of Their Biological Applications",
	 "lenArticle": "PhD Qualifying Examination by Yong YU on 7 January 2010 in Room 4577 at 16:00. Title: Preparation of Aggregation-Induced Emission-Active Nanomaterials and Exploration of Their Biological Applications"
	},

    {
	 "date": "05-Jan-10",
	 "category": "Spotlights",
	 "name": "Solving Chemical Engineering Problems via Parallel Evolutionary Approaches",
	 "lenArticle": "MPhil Thesis Presentation by King Hei WONG on 5 January 2010 in Room 4577 at 14:00. Title: Solving Chemical Engineering Problems via Parallel Evolutionary Approaches"
	},

    {
	 "date": "28-Dec-09",
	 "category": "Spotlights",
	 "name": "Preparation, Characterization and in Vivo Evaluation of Polyether Polyol-platinate Conjugate",
	 "lenArticle": "MPhil Thesis Presentation by Ping ZHOU on 28 December 2009 in Rm 4577 at 11:00 am. Title: Preparation, Characterization and in Vivo Evaluation of Polyether Polyol-platinate Conjugate"
	},

    {
	 "date": "17-Dec-09",
	 "category": "Spotlights",
	 "name": "Gas-Particle Partitioning of Organic Vapors on Organic Aerosols",
	 "lenArticle": "PhD Qualifying Examination by Lap Pong CHAN on 17 December 2009 in Rm 4577 at 15:00. Title: Gas-Particle Partitioning of Organic Vapors on Organic Aerosols"
	},
 
    {
	 "date": "13-Nov-09",
	 "category": "Spotlights",
	 "name": "Synthesis and Characterization of Palladium Based Nanocatalysts for Direct Formic Acid Fuel Cell Applications",
	 "lenArticle": "PhD Qualifying Examination by Yange SUO on 13 November 2009 in Rm 4577 at 10:00 am. Title: Synthesis and Characterization of Palladium Based Nanocatalysts for Direct Formic Acid Fuel Cell Applications"
	},

    {
	 "date": "16-Sep-09",
	 "category": "Spotlights",
	 "name": "Ultrasound mediated intrascleral macromolecule deliver",
	 "lenArticle": "MPhil Thesis Presentation by Cheung Chi Yeung on 16 September 2009 in Room 4577 (lifts 27-28) at 15:00. Title: Ultrasound mediated intrascleral macromolecule delivery"
	},
 
    {
	 "date": "07-Sep-09 ",
	 "category": "Spotlights",
	 "name": "Towards a Paradigm for Chemical Product Design and Development",
	 "lenArticle": "PhD Qualifying Examination by Yuen Shan CHENG on 7 September 2009 in Room 4577 (lifts 27-28) at 10:30 am. Title: Towards a Paradigm for Chemical Product Design and Development"
	},
 
    {
	 "date": "02-Sep-09",
	 "category": "Spotlights",
	 "name": " Feasibility, Flexibility and Reliability in Chemical Process Designs",
	 "lenArticle": "PhD Thesis Presentation by LAI Sau Man on 2 September 2009 in Rm 4577 at 1400, Title: Feasibility, Flexibility and Reliability in Chemical Process Designs"
	},
 
    {
	 "date": "24-Aug-09",
	 "category": "Spotlights",
	 "name": "Pharmaceutical Salt Formation Guided by Phase Diagrams",
	 "lenArticle": "MPhil Thesis Presentation by LAM, Ka Wing on 24 August 2009 in Room 4577 (lifts 27-28) at 14:00. Title: Pharmaceutical Salt Formation Guided by Phase Diagrams"
	},
 
    {
	 "date": "21-Aug-09",
	 "category": "Spotlights",
	 "name": "Toughening Mechanism of Polypropylene/Calcium Carbonate",
	 "lenArticle": "PhD Thesis Presentation by Lin Yong on 21 August 2009 in Room 4577 (lifts 27-28) at 10:00 am. Title: Toughening Mechanism of Polypropylene/Calcium Carbonate"
	},
    
	{
	 "date": "14-Aug-09",
	 "category": "Spotlights",
	 "name": "From Chlor-Alkali Electrolysis to Electrochemical Disinfection – 30 Years Research and Education in Applied Electrochemistry at NHALT UNIVERSITY Koethen, GERMANY",
	 "lenArticle": "Joint Seminar by Departmetn of Chemical and Biomolecular Engineering, Center for Green Products and Processing Technologies and HKUST Fok Ying Tung Graduate School on 14 August 2009 in Room 4577 (lifts 27-28) at 14:00. Speaker: Dr Henry Bergmann, School of Applied Sciences, Anhalt University. Title: From Chlor-Alkali Electrolysis to Electrochemical Disinfection – 30 Years Research and Education in Applied Electrochemistry at NHALT UNIVERSITY Koethen, GERMANY"
	},
 
    {
	 "date": "14-Aug-09",
	 "category": "Spotlights",
	 "name": "The characterization of Hong Kong sweage sludge and its ash utilization in cement production",
	 "lenArticle": "MPhil Thesis Presentation by Fai Yeung Chan on 14 August 2009 in Room 5583 (lifts 29-30) at 10:00 am. Title: The characterization of Hong Kong sweage sludge and its ash utilization in cement production"
	},

	{
	 "date": "14-Aug-09",
	 "category": "Spotlights",
	 "name": "Amazonian Aerosol Characterization Experiment (AMAZE-08)",
	 "lenArticle": "Joint seminar by Dept of Chemical and Biomolecular Engineering and Institute for the Environment on 14 August 2009 in Room 1003 (Lift no. 4) at 15:00. Speakers: Scot T. Martin and Gordon MCKAY. Title: Amazonian Aerosol Characterization Experiment (AMAZE-08)"
	},
 
	{
	 "date": "14-Aug-09 ",
	 "category": "Spotlights",
	 "name": " Bioprocessing of Stem Cells",
	 "lenArticle": "Seminar by Prof. Zhanfeng Cui on 14 August 2009 in Room 6581 (lifts 27-28) at 14:00. Speaker: Prof. Zhanfeng Cui, Oxford University. Title: Bioprocessing of Stem Cells"
	},

	{
	 "date": "14-Aug-09 ",
	 "category": "Spotlights",
	 "name": "Luminescent metal complexes for bioanalytical applications",
	 "lenArticle": "Seminar by Prof. Ming Zhou on 14 August 2009 in Lee Siu Lun Lecture Theatre (LTK) at 14:30. Title: Luminescent metal complexes for bioanalytical applications"
	},

  	{
	 "date": "13-Aug-09",
	 "category": "Spotlights",
	 "name": "Enhanced abatement of aqueous organic compounds using stratified activated carbon adsorption columns",
	 "lenArticle": "PhD Thesis presentation by Fan Fu Sze on 13 August 2009 in Room 3598 (lifts 27-28) at 15:00. Title: Enhanced abatement of aqueous organic compounds using stratified activated carbon adsorption columns"
	}, 

 	{
	 "date": "12-Aug-09",
	 "category": "Spotlights",
	 "name": "Design of a Waste Tyre Pyrolysis Process",
	 "lenArticle": "MPhil Thesis Presentation by King Lung Lee on 12 August 2009 in Room 2302 (lifts 17-18) at 15:30. Title: Design of a Waste Tyre Pyrolysis Process"
	}, 
 
	{
	 "date": "12-Aug-09",
	 "category": "Spotlights",
	 "name": "Desulphurization of Liquid Hydrocarbon Fuel",
	 "lenArticle": "MPhil Thesis Presentation by Sin Wa Wong on 12 August 2009 in Room 2302 (lifts 17-18) at 13:00. Title: Desulphurization of Liquid Hydrocarbon Fuel"
	},

	{
	 "date" : "12-Aug-09",
	 "category": "Spotlights",
	 "name": "Production of characterization of activated carbon from waste tyre char by steam activation",
	 "content": "MPhil Thesis Presentation by Kit Ying Yeung on 12 August 2009 in Room 4577 (lifts 27-28) at 09:00 am. Title: Production of characterization of activated carbon from waste tyre char by steam activation"
	},

	{
      "date": "11-Aug-09",
      "category": "Spotlights",
      "name": "Multivariate statistical monitoring and cault diagnosis of two-dimensional dynamic batch",
      "lenArticle": "PhD Thesis Examination by Yuan YAO on 11 August 2009 in Room 4577 (lifts 27-28) at 10:00 am. Title: Multivariate statistical monitoring and cault diagnosis of two-dimensional dynamic batch"
    }

]